
第一项修炼—自我超越（personal mastery）；
第二项修炼—改善心智模式 （improving mental models）；
第三项修炼—建立共同愿景（ building shared vision）；
第四项修炼—团体学习（ team learning）；
第五项修炼—系统思考 （systems thinking）。


1. 学习型组织

不同于传统的“控制型组织”，优秀的领导者广泛分布于学习型组织的各个角落，而不是只处于高层。“在其中，大家得以不断突破自己的能力上限，创造真心向往的结果，培养全新、前瞻而开阔的思考方式，全力实现共同的抱负，以及不断一起学习如何共同学习”。

2. 系统思考

系统思考是一个概念框架、知识体系、工具集合，它的功能是让各类系统模式清晰可见，并帮助我们认识如何找到杠杆作用点来有效地改变这些模式。系统思考修炼强调用整体论而非还原论的观点理解世界：世界是联系的；世界是变化发展的。

3. 自我超越

自我超越用来描述个人成长和学习的修炼。自我超越基于能力的开发【明目】和精神的成长【扩胸】，它旨在把自己的生命视为一件创造性的艺术作品，并不是以被动反应的观点去生活，而是从主动创造的视角去生活。自我超越修炼包括两方面行动：不断澄清什么对我们是最重要的【顶天】；不断学习如何更清晰地观察现实【立地】。

4. 心智模式

“心智模式是决定我们对世界的理解方法和行为方式的那些根深蒂固的假设、归纳，甚至就是图像、画面或形象”。如何显现和挑战我们的心智模式以应对变化的环境？这包括两方面的技能开发：行动中的反思技能和探寻技能。

5. 共同愿景

共同愿景回答如下问题：“我们想要创造什么？”它不同于“志向”，它是明确而可知的未来图景。出自真心的共同愿景是学习实践的焦点和动力来源，只有唤醒了大家对真正想成就的共同愿景，生成性学习和创造力才能从概念转为现实。“愿景是什么并不重要，重要的是愿景能做什么……”；“愿景的源头其实并不重要，它得到分享的过程才是关键”。

6. 团队学习

团队，而非个人，才是现代组织的基本学习单位。团队学习是协同校正培养默契的过程，是开发团队能力和集体智慧的过程。团队学习修炼包括深度汇谈和商讨两种交流艺术的实践，通过这两项实践可以移除习惯性防卫的学习障碍，释放出巨大的学习潜力。


https://book.douban.com/review/1556039/
https://book.douban.com/review/6470852/

http://www.cnblogs.com/fuleying/p/3481355.html