https://book.douban.com/review/5024153/

1、草莓酱定律：面积涂的越大，酱就越薄。它说明如果被过分引申，任何深刻的寓意都会被减弱。(The Law of Strawberry Jam)
2、葡萄蜜饯定律：永远不会有人抱怨葡萄蜜饯。如果期望不高，就永远不会失望。(The Law of Grape Jelly)
3、集中原则：要想学到东西，就不能试图样样都学会。选出重点，事半功倍。(The Lump Law)
4、阅读原则：绝不要阅读任何不值得阅读的内容。
5、废物警告：任何不值得做的事情都不值得去把它做好。绝对不要去为垃圾做美丽的包装。
6、直觉过滤器：无论什么事情，按自己的价值观而言，是不应该做的，就不去做。就是这样。尽管有些事情对某些人而言是值得的。
7、犯错：别指望通过阅读、聆听或者记忆，就可以获取别人的智慧，智慧源自亲身经历，词句只不过是调味品。只有调味品是不能维持生存的。
    当你看到他人的举措不明智的时候，请你一定不要自以为是。
8、适度理性规则：不要过于理性rationality，要通情达理reasonableness。
    听起来明智的事情并不见得都真正明智。
    如果它让你感到疼痛，那它必定对你有益。
    做美味佳肴需要时间。
    如果你的咨询师告诉你，因为它使你疼痛，所以必定会对你有益，那你一定要赶紧另请高明。

9、唯利是图座右铭：损失大量钱财的一个最佳途径就是纯粹为了钱而做事。
    挣大钱的一个最佳途径就是只做事而不考虑钱。
    如果想靠咨询谋生，你就要考虑钱的问题，但同时也要留心其他重要方面，比如与你打交道的人的品质。
    提防贪欲，尤其是自己的。
10、傻子综合症：了解你的局限，无所不知的人最容易受骗。(The Sucker Syndrome)
11、不知道很可能并不会对你有伤害，但不记得却总会有。
12、快餐谬论：没有差异加上没有差异加上没有差异加上……最终等于显著的差异。
    最安全的做法是嵌入检查点(checkpoints)，强迫自己定期检查自己的智慧宝盒。
    
一 开篇
1 草莓酱定律：面积涂的越大，酱就越薄(如果被引申过分，任何深刻的寓意都会被减弱)
2 果酱定律：只要还有颗粒，草莓酱永远不会被涂抹得过薄(只要有亲身体验的方式，你的信息就不会无限度失去价值)
3 葡萄糖饯定律：永远不会有人抱怨葡萄蜜饯(成本低、无颗粒)(把课程简化为一系列容易执行的步骤)

二 咨询工具箱
【1】智慧宝盒——分辨什么适合我以及什么不适合我的能力。
1 集中原则：要想学到东西，就不能试图样样都学。(选出重点会事半功倍)
2 雷丁的阅读原则：绝对不要阅读任何不值得阅读的内容。(只要不去阅读无用的内容，阅读速度的提高没有什么意义)
3 卡里的废物警告：任何不值得做的事情都不值得把它作好。(不要掉入完美主义陷阱，把垃圾进行高质量的美化工作)
4 弗里伯的直觉过滤器：无论何事，只要不该做，就不去做。(不受他人的影响，要相信自己智慧宝盒做出的选择)
5 适度性规则：不要过于理性；要通情达理(理性过于严谨，而通情达理依靠合理、合情、直觉、数据等作出判断，同样可靠)
6 谨防理性化：听起来明智的事情并不见得都真正明智(有些纯粹的理性化产物，却被误认为是合理的意见)
7 唯利是图座右铭：损失大量钱财的一个最佳途径就是纯粹为了钱而做事。(要考虑钱，但同时也要留心其他方面的事情。 )
8 傻子综合征：无所不知的人最容易上当。
9 最重要的格言：不知道(如何解决)很可能并不会对你有害，但不记得总会有。(对于不易察觉的环境时，应该嵌入检查点，定期检查智慧宝盒，防止遗忘它)

【2】 金钥匙——开辟新领域和放弃不适时领域的能力。
1 波兰斯基指示器：如果人们非常确定问题不在某处，那么问题很有可能就在那儿。(人们常常因为盲目自信而不去检查那些自己认为没有问题的地方)
2 波兰斯基推论：不必在所有人都指向的地方寻找。(如果真的知道在何处寻找，人们就不会请咨询师来帮忙找到问题所在)
3 丹尼决策法：当不再学到新东西时，就该换换方向了。(咨询师之所以为咨询师是因为他掌握了别人所不知道的东西)
4 顾客的锁语：例如：禁止你查看XX，不然他们会不高兴的(挖掘紧缩大门背后的信息，比如询问他们是谁。避免无休止的提问)
5 催眠词语：语意不清，容易被解释任何含义。(例如“应该”，很可能被解释为“本应，实际没有”，类似的还有尽快、only、all、anything)
6 暗示永恒不变的评论——咨询师最危险的锁语，如我是咨询师(在永恒不变的评论前加上“ 到目前为止….”)

【3】勇气棒——尝试新鲜事物和冒险的能力。
1 懦夫的信条：勇气不是一种感觉，而是一种外在表现。(勇气其实是冷静和谨慎计划的结果，恐惧=发现一切可利用的资源)
2 Fraidycat 规则：如果对事物A的恐惧大于事物B，那么你会选择事物B。(如何让客户选择A：增加B的恐惧、减少A的恐惧、采取出乎客户的意外行动)
3 不要照章办事(照章办事的原因：照章办事即使错了，也很少受到惩罚)

祈愿杖：争取得到自己所想要的和必要时接受无法获得的结果的能力。
1 在明白自己愿望是什么之前，不要担心它们是否可行、合理、能被接受。
2 和客户的经纪人谈判不可能改善你的处境，因为他们是专家而你是业余的。(解决办法，雇佣一个律师或职业调解人去和对方谈判，不要雇经纪人)
3 快乐定理：如果你对代理的份额不满，他们就会因此而受穷。(当你对合同一无所知时，千万不要签订，谈判之前可以找客户曾经的承包商交流)
4 终极抑郁定理：如果不知道自己想要干什么，你就不大可能得到它。( 抵制诱惑，不要签订合同期过长的约束性合同)


【4】侦探帽(&放大镜)：研究数据和数据分析推理能力。
1 铁路逆向悖论：如果某项服务过于出色，服务商就很可能永远听不到意见，因而他们将会取消此项服务。
(许多咨询师误把客户的沉默当成对其服务的不满)
2 家庭主妇谬论：家庭妇女唯一重要的事情就是呆在家里等候上门服务。
(千万不要假定客户除了再电话旁等你的电话外没有更好的事做)
3 斜边假设：当三角形阻碍了你获得数据资料，请选择使用其斜边。
(我看到或听到的哪些特定内容导致我对此人产生了那种印象)
4锤子规律：孩子若收到锤子作为圣诞礼物，就会发现每件东西都需要捶打。
(你的数据会倾向于你擅长的调查方式)
5韦纳图书馆定律：没有答案，只有交叉引用和相互参照。
(避免成为锤子规律的牺牲者，应尽可能用多种方法收集数据)
6 莱吉恩规律：如果行动开始变得徒劳，那就去搜索信息。如果信息也变得徒劳，那就去睡一觉。
(收集数据时遇到麻烦的时候使用这一规律)
7 危机偏差：一旦身处险境或心存疑问，就开始团团乱转和大喊大叫。
(身处险境易使咨询师收集到一些无用数据或捏造数据)
客户面试咨询师提出一些荒唐问题时咨询师的策略：
8侦探第一法则：寻找到问题时，不要被找到的第一个问题所迷惑。 (个人认为翻译不好，法则与实例让人无法联想到一块)
(面试官对面试者缺乏敏感，根本不考虑面试者的感受。)
9 侦探第二法则：横竖都是死(死暗指放弃项目)
(一个关键的理由足够说明你为什么不能接受任务，不需进一步解释)
10 Nedlog规则：他们怎么对待别人，最终也会怎么对待你。
(如果你的客户在你面前说别人的坏话，最终也会在别人面前说你的坏话)
11侦探第三法则：通过对方的提问获取你需要的信息。
(客户问的一些愚蠢的问题不是因为他们无知，而是因为他们甚至不知道自己的无知)
12　侦探第四法则：如果你不能理解对方为何问这些问题，那么这些问题很可能来自于某些人不希望你了解的某种动机——比如对方面试你仅仅是处于礼节，实际并不想雇佣你。
( 使用侦探帽使自己平静，认真思考他们提这些问题的意义所在)
13 舍比第四法则：如果一件事情的做法过于复杂，那么你很有可能做错了！
(如果你的思考能力不是特别好，那就不要想太多)
14侦探第五法则：混乱更偏爱既定规定，所以请利用你的混乱去找出罪魁祸首。
(混乱的公司制度更偏爱公司执行管理人员，所以罪魁祸首可能是雇佣你的管理人员)

【5】是/否徽章：开口说是/否(抱歉)以及真诚表达的能力。
1 撒特的温柔拒绝法：如果你不想做，那就简单说它不适合你，不要找借口。
( 你的借口很可能会因客户的进一步询问导致更糟糕的局面)
2 戈登的初次咨询法则：对于客户的第一次提议，不说不也不说是。
(不要对客户的提议说“是”，而是对考虑这一提议说“是”)
3 马修的是/否信号：诚实的人无须通过声明自己诚实可靠来证明自己所说的是与否。
(好好反省下自己在表达是/否的时候是否带有某种自我宣扬的意图)
4 老好人指南：如果你一定要让每个人都喜欢你，那就离开咨询界吧。
5 是/否规则的转换：将规则转换为行动指南时可以增加可选择的内容，而不是被迫接受。
(强调规则的灵活性，比如“永远不要接受馈赠”，但有时候如果你不接受仅仅是一个象征友谊的小礼物，对方会很不高兴。)


【6】心：专心而聪明地进行工作的能力和愿望，而不只有好的态度。
1 人的斜边假设：当甲隔离了你的心A和另一个人的心B，那么请选择A与B之间的最短距离。
(间接表达可能反而伤害别人感情。而阻碍直接交流却常常源于我们自身“心”的回避)
2 被激活的“心”：必须倾听自己的步伐，有意识地去做。
(我的理解是不要因为怕伤害对方而刻意回避，可以通过一些“模糊”的交流获取信息)
3 并行悖论：与客户太相似，你就不能吸引他们；与客户差太远，你又会将他们吓跑。
(更好的方法是只需保持自我)
4心的测试：如果你不关心他们或他们的问题，那么就不要为他们作咨询。
5生存规则：与其拼死努力，不如或者成功。
( 凡事必须有限度，如果有人请求你拼死相助，你就不会想帮助他)

【7】镜子：审视自我以及寻求和利用反馈的能力。
1 三指规则：指责他人时，请注意你的其他三个指头指向何方。
(与其立刻给出第一反应，不如三思而行)
2 莫妮卡奇妙的镜子：合同谈判对双方都是一个审视自我的绝佳时机。
(合同谈判时一个提出反馈意见的绝佳时机)
3 莫妮卡的镜子忠告：有些人根本不想去着非凡的镜子。
(并不是每个人都喜欢利用镜子自省)
4斯威尼的小签名法则：想获得一个有意义的承诺，在书面合同上签字。
5 帮助模式：不管表面看来如何，每个人都在努力想对事情有所帮助。
(把对方反馈意见(可能另你不快)当成一种提醒，而不是责备。)
6 肯尼的汽车修理定律：一贯需要修理或替换的部分总是藏在最难到达的位置。
( 你最需要持续调整或总是出问题的部分也总是那些你最不容易接触到的部位。)
7 一号秘密：根本不存在秘密。因为每个人都可以观察人类行为。
8 撒特的三个通用问题：(工作前用，有利于掌握全景)
1过去：我怎样达到？(我是如何联系到客户的)
2现在: 我在这里感觉如何？
3将来：我希望发生什么？(为什么接受这项目？成功是什么？我想在这里干多久？)


【8】望远镜：提醒我超越肉眼和大脑的局限来了解他人，并给予他们更多的理解。
1还是撒特的三个问题：(这次是针对客户)
2对他人产生偏见时，使用望远镜聚焦清单：自我感觉、环境、他人的记录、与自己认识的其他人有相似之处而产生错误印象？、投影、分类、心灵感应、合作历史、传闻、分享
(我看到或者听到的哪些特定内容导致我对此人产生了那种印象？)

【9】鱼眼镜：对自己和他人所处环境的观察和分析能力
1 伊莎贝尔最初的暗示：开始时你所面临的永远不会是一张白纸。
(你要了解客户的背景而非从0开始)
2 集中法则推论：对一个人是蜜糖，对另一个人可能就是毒药。
3 高效咨询第一法则：如果某种方法不起作用，那就试试别的法子。
(找出客户的偏好，是概念？数字？公式？图表？)
4 Don的偏差推导：如果太规则，它就不是观察而得的自然数据；而是被设计出来的结果。
(机械措施的强制下仍然可能会有因为个性而产生的结果)
5 解决问题定律：你越接近于发现谁是引起问题的原因，问题被解决的可能性越小。
(应该使用分离变量法，将问题本身和谁该因问题受到责备分开)
6 背景障碍：鱼儿总是最后一个看到水
(当我们考虑问题的时候，我们总是倾向于从思考中忽略掉那些我们已经习惯了的东西。)
7前景障碍：鱼儿总是第一个看到空气
(如果人们已经习惯了周围环境中的平常事物，他们就会去关注自己不习惯的事物 )
8 5分钟规则：客户们总是知道如何解决自己的问题，而且总是在交流的最初5分钟内说出解决方案。
9 弯曲信道之谜：如果收到的信息很难于理解，请首先检查信息渠道是否通畅
(强调一个清洁环境的重要性)

【10】陀螺仪：使自己的内心情感和外在行为保持一致或平衡的能力。
1 完美平衡悖论：如果你想保持不协调状态，那就努力去实现完美的协调一致吧。
(平衡只是个过程，而不是位置，它并不是完美无瑕)
2 体脑指示：首先要信任你的身体，然后再信任你的头脑
(身体直接反应现实，头脑不过是诠释身体所传达出来的感觉)
3 帕森特异原则：如果他们行为古怪，那很可能是他们对某件奇怪之事的反应；也许正因为我。
4 进行调整： 放松身体、用“我”来开始评论(“你”字有责备含义)、耐心等候对方回答。
5 输赢学习定理：如果你保持协调一致，虽然输赢皆有可能，但总会有收获。
6 魔力模式：权威咨询师所说的话容易被过分夸大
(你越协调一致，就越需要注意自己的言语)
7 代理综合症：不管你或他们多么想做，你也无法代替别人达到协调一致。
(只有客户在场边学习的时候，咨询师才会去示范如何去做)
8 知觉至上论：经历不只是最好的老师，还是唯一的老师。
(但它不一定见得会教你什么，对协调一致的追求练习必须在安全、有利于接纳知识、有帮助的环境之中)


【11】蛋、登山钩、羽毛——额外的工具
1蛋：从自身吸收需要的全部营养成分来成长、发展和学习的能力
(提醒我们每个人生来都具有那些工具，而且我们身长还隐藏着无数未知的程序，我们甚至可以自己去创造新的工具，学无止境。
2登山钩：确保自身安全和避免无谓风险的能力。
(每一个可能跌倒或失败之处，举出一个返例来进行反驳——帮助客户走出双重困境
注意安全、选择权和创造性三者的关系)
3 羽毛：逗自己和他人发笑以及轻松对待事物的能力。
(既然有些事情对大局无关紧要，不如轻松看待，不要太在意，保持乐观)


【12】沙漏——为重要事情抽出时间和充分利用时间的能力
1 时间管理的沙漏的组成部分：
a浪费时间：混乱、急躁、草率下结论、缺乏计划、错误、缺乏耐心、拒接接受现实、糟糕的组织、不合理的期望、打破自己的原则
b节省时间：信任、合理运用金钱、备份、留有余地、可靠的人、教导新人、测试、培训(尽早)、理性。
2 杰里项目生涯铁的规则：它总会花更长的时间
(做好延误的贮备，准备好适应突变的情况，宽容对待意外出现的延迟)
3定时炸弹：所有恶性最终都将得到报应
(草率行事是浪费时间的“最可靠”办法)
4 懒惰原则：绝对不要在今天做那些明天可能不必做的事；事实上，连想都不用想
(PS:当发现自己正在做时间的事情时，立刻停止)
【13】氧气面罩——代表我和谐而生机勃勃的人生，而非仅仅某个时刻。
(寻求支持和练习自我照顾)