生活之树常青，而理论往往是灰色的。    --- 歌德
有些崇高的理想比堕落还要坏。          --- 王小波
天赋：1. 认为天赋是能力，但实际上，天赋是潜力。
      2. 天赋是某种天生的特性，让一个人可以在同样起点的情况下，比一般人更加快速地成长。

      "好为人师"是顾问的大忌；"大牛顾问"是顾问的恶梦；"大获全胜"是顾问的末路。
[9大让你变穷的原因，哪一条是你现在的生活轨迹？]
1、犹豫不决——比鲁莽更糟糕的是犹豫不决。
   比鲁莽更糟糕的是犹豫不决，像墙头草一样摇摆不定的人，无论其他方面多么强大，在生命的竞赛中总是容易被
   那些坚定的人挤到一边，雷厉风行难免会犯错，但比什么也不敢做的强 。怀特 黑地说："畏惧错误就是毁灭进步。"
2、拖延——计划很丰满，执行很骨感。
   很多时候拖延就是逃避问题和懒惰，把横在面前的困难放大，望而却步 ，抱着能拖一天是一天的心态找各种借口逃避，
   经常抱怨：无聊的工作，苛刻的老板，隔一天在做也没关系，随之而来，我们会陷入"工作越来越无语", "人生越来越无聊"
   的泥潭中。著名思想家罗曼 罗兰说：懒惰是很奇怪的东西，它让你以为是安逸、是休息、是福气。但实际上它所给你的
   是无聊、是消沉 。
3、三分钟热度——世界上有80%的失败都源于半途而废。
   三分钟热度的人不过是从来没有体验到坚持做一件事，成功后带来的喜悦，因为坚持的过程总是枯燥又充满挫折的，
   人的天性又是好逸恶劳 ，每一年一开始笔记本的前几页都写满了宏伟的计划，后面几乎都是空白 … 购买一本好书，
   可惜得是现在都还没开始读…几乎所有的人都有过雄心勃勃地制定机会，心灰意冷地放弃计划的经历。
4、害怕拒绝——厚重而脆弱的自尊。
   一个能放下自尊去做事情的人，是专注目标成果导向的人。而把自尊心放在第一位的人，在人际交往做事情的时候，
   总关注在他人对自己的态度。所以，一个人越是百无一用的时候，越执念于那些无足轻重的底线与小自尊心 。
5、自我设限——杀死自己的潜能力。 平庸的人总是抱怨自己不懂的事情。
   杀死自己的潜能力，他们经常这样说："我i想做a ，但是我怕做不到，因为、c、d、e种原因 。"他们还没做之前就先否定
   自己，并给自己找了一堆不付出努力的理由 ，所有的平庸与低成就都是自我设限的结果。
6、逃避现实——白日梦患者。
   白日梦患者，逃避现实的人有5大特种：1.经常做白日梦 2. 喜欢随心所欲，无拘无束的生活3. 沉迷游戏或是魔幻小说 
   4. 觉得现实世界很残酷 5. 无法面对不稳定环境。
7、总找借口——错不在我，人一旦犯了错，第一反应常常是自我辩护 ，喜欢找借口的人发现他们都有一个共同的特点：
   没有强烈的事业心，没有执着的追求，人生没有一个坚定的信念 。所以，遇到压力，遇到困难，他们就不承担，
   也不想承担 。
8、恐惧——谨小慎微的懦弱。
   谨小慎微的懦弱，他们在工作中总有这样的感受，害怕被领导批评，害怕别人觉得自己无能，害怕被别人知道自己的缺点，
   在意他人的评价，害怕犯错，害怕自己的付出得不到回报 。 
9. 拒绝学习
   你不是寂寞，只是不想学习。学习需要费脑子 ，自我成长需要不断和自己作斗争，多痛苦啊！还不如舒舒服服躺在家玩手机，
   玩电脑。然后看到同龄人薪资比你高 ，生活比你好的时候，你又在朋友圈感叹时运不济 。

第零章：序言
1. 成长、能力和良好的人际关系就是让我们对自己和别人都感觉很好   --- 萨提尔
2. 理性的看待非理性 -> 1. 保持理性，然后被逼疯；2. 变得不理性，然后被别人成为疯子。
3. 在当今世界，也许只有远离尘世的人才能不感到困惑吧。
4. 睿智的顾问在回答问题时，既能认可客户的自我价值，也不会降低他自己的价值
5. 铺的越广，摊得越薄。——树莓酱定律。咨询的一部分来自于范围广，无法聚焦。
                       ——它说明如果被过分引申，任何深刻的寓意都会被减弱。
6. "好为人师"是顾问的大忌；"大牛顾问"是顾问的恶梦；"大获全胜"是顾问的末路。   

[你一直以来想要解决的都是错误的问题]
1. 当你只是想找人成为你的替罪羊的时候，不要找咨询师。
  你需要真的想要解决你所描述的问题，而不是只想要告诉你的老板，如果这位昂贵的咨询师也无法解决这个问题，你也不能怪我们解决不了问题。
2. 如果咨询师的成功会让你看起来像个失败者，那么不要找咨询师。
   比如，如果你的老板认为如果任何人需要帮助的话，他就是个傻瓜，那么不要找咨询师了，你需要的是一个新老板。
3. 不要找最便宜的咨询师，也不要找最贵的咨询师。
   要找一个有人个人向你推荐过的咨询师，这个推荐者自己要雇佣过这位咨询师。你需要确定，如果你得到的建议成功的话，
   那么所得的价值可以负担支付给这位咨询师的钱。
4. 如果你还没有准备好会有人告诉你：你一直以来想要解决的都是错误的问题，那么你也不要找咨询师。大概有一半时间在我做咨询师的时候，
   我最重要的建议就是告诉他们关于他们问题的另一个定义。

[市场上有很多咨询公司，他们各有所长。一家公司如何找到一位适合他们的咨询公司呢?]
 你的问题不是该如何选择合适的咨询公司。你的问题可能是如何找到一位合适的咨询师。咨询公司一般都想让你相信他
们派给你的任何咨询师都和他们公司的其他咨询师一样胜任。这绝对是错的。从来就没有这样的事，除非这家公司只有
一个员工。

[有时候对于咨询师的不满只有在咨询的过程中才能发现，如何避免这样的问题？]
    从开始就要记住，而且要不断提醒自己，你可以在任何你不满意的时间"解雇"一位咨询师。如果你把这点牢
记于心，你就会在当初选择的时候更加小心，因为你无法把失败归罪到别人身上了。"如果这位咨询师不够好，那么你
为什么要选择他/她呢？"
    在我的工作中，我总是给我的顾客一个退款保证。如果他们觉得我的工作不够让人满意，他们只需要求，我就会
退还他们一部分甚至全部钱款。

[如何发现表面现象后的真实问题？]
    多数时候，人们不断在解决问题上败下阵来的原因就是他们的问题定义是错的。所以，在一头扎进"如何解决"这个问题之前，
先花时间质疑和整理你正在使用的问题定义。

这本书不仅仅是一本关于咨询奥秘的书，而且是一本关于与人相处艺术的书。
生活是人类的老师，温伯格把生活的点滴集聚起来，奉献给大家，深入浅出的讲解人和人交际的道理。
所以他说咨询是：应人们的要求去影响他们的艺术。因为人们需要某种变化或是担心发生某种变化，所以他们会去做这样那样的咨询。

第一章：咨询为什么这么难?
    咨询为什么这么难——这一章主要讲当顾问就得有阿Q精神，有个好心态，别总以为自己能解决客户的问题。
    
舍比咨询定律
1. 咨询第一法则，无论客户和你说什么，问题始终存在。 
              -- 不管客户和你说什么，问题总会有。
    在管理的文化中，最糟糕的事情莫过于向任何人承认你自己有搞不定的问题。如果真的需要帮助，就得想办法
悄悄解决，决不能公开承认出现了任何问题。
    没有几个人愿意承认自己有病，但大多数人愿意承认能够有所改进，除非这个人真的病入膏肓。
   1.1. 百分之十承诺法则，不要承诺会有百分之十以上的改进。
                          永远不要承诺百分之十以上的改进。
   1.2. 百分之十解决法则，如果你不小心取得了超出百分之十的改进，要保证这部分改进不被注意到。
                          如果不小心让改进超过了百分之十，要确保没人注意到它。
2. 咨询第二法则，无论问题最初看起来怎么样，它始终是人的问题。
              -- 不管一开始看起来什么样，它永远是人的问题。
   2.1. 马文定律，不论客户在做什么，都要建议他们做些别的。
                  不管客户在做什么，都要建议他们做些别的。
   高管应避免任用埋头苦干，独自处理事情的人为经理。
3. 咨询第三法则，不要忘记客户是按时间付费，而不是按照你的解决问题的程度付费的。
              -- 永远不要忘了客户是按小时付费，而不是按解决方案付费的。
   3.1 赏识规则，如果你在意谁得到了赏识，你就永远不能完成任何事。
   3.1 功劳法则，你要是在意功劳在谁头上，那就啥事也干不成了。
   为了把功劳记给顾问，就得承认有了解决方案，如果要承认又解决方案，就得承认有问题，这可要命了！经理和顾问
   都靠解决问题的能力吃饭，要让一方承认需要另一方，就等于承认自己能力不够。
4. 孤独守卫者幻想，如果客户没有表现出对你的欣赏，那就假装他们对你的接触工作感到震惊 -- 但千万不要忘记这只是你自己的幻想，而不是事实。
                   要是客户没有表现出对你的欣赏，就假装他们被你的表现惊呆了，但千万不要忘记这只是你的幻想，不是他们的。
5. 舍比法则，如果他们没有雇用你，就不要为他们解决问题。
             要是他们没有聘用你，不要帮他们解决问题。
   5.1 别奢望自己什么都能搞定，顾问得靠客户来执行想法
6. 草莓酱法则，面铺得越广，实质就越少。--- 我想帮助别人，还想因此而发财。
               铺的越广，摊的越薄。    --- 要名还是利，自己挑吧。
   6.1 如果被过分引申，任何深刻的寓意都会被减弱。
   6.2 咨询的一部分来自于范围广，无法聚焦。
   6.3 想要同时成为有影响的人和过上体面的生活是徒劳的。
7. 双胞胎法则，在绝大多数时间里，在世界上绝大多数地方，不管人们工作得多辛苦，都不会有什么重大事情发生
               大部分时间，在世界上大多数地方，不管人们有多努力，都不会发生没大事。
   很多事情，小时候就养成习惯会容易些吧
8. 鲁迪黄萝卜理论，一旦你消除了你的头号问题，第二号问题就会升级。[凡事不要高兴得太早，消除问题同时，要注意平衡]
                   一旦你干掉了头号问题，二号问题就升级了。
   作为顾问，我常常非常专注于客户的问题，有时候甚至相信自己真的能够一劳永逸地解决他们的问题，
   但根据鲁迪的理论，永远都会有另一个问题出现。
9. 艰难法则，如果你不能接受失败，你就不能成为顾问。
             要是不能就收失败，做顾问就永远不会成功。
   确实有人做顾问成功了，所以失败肯定还是可以对付的。
10. 更艰难法则，一旦消灭了头号问题，你就让二号问题升级了。
   在任何情况下都能找出问题，这样的能力是顾问最宝贵的财富，也是职业病
   能解决问题的人确实过得更好，但能有意识无视问题的人过的最好。如果没法做到这两点，还是别干咨询了。
11. 最艰难法则，帮自己甚至比帮别人更难。 --- 能够接受失败并无视问题。
                帮助自己比帮助别人更难。
    
1. 客户经理们没希望顾问解决所有问题
2. 顾问也不要解决所有问题而不给客户经理留面子
3. 解决了问题功劳也是客户经理的
4. 没有不贬损咨询顾问的客户高管，也没有不贬损客户高管的咨询顾问
5. 在管理的文化中，最糟糕的事情莫过于向任何人承认你有自己搞不定的问题
6. 不要急切想要在工作中表现的过火，因为改进太多，客户不会聘用你，因为这会迫使他们承认自己又问题，所以每次改进10%
7. 不管客户在做些什么，都要建议他做点别的
8. 咨询的现实就是客户说"看，我们意识到有问题，正在努力解决，而且已经请了一个顾问"，等顾问一走，客户又会说"看，我们花了大价钱，请了三个月顾问，问题都没搞定，显然这个问题根本没有办法解决！"——所以经理们花钱可能不是要解决方案，是给上司一个借口！
9. 为了把功劳记给顾问，就得承认有了解决方案，如果要承认又解决方案，就得承认有问题，这可要命了！经理和顾问都靠解决问题的能力吃饭，要让一方承认需要另一方，就等于承认自己能力不够。
10. 要是客户没有表现出对你的欣赏，就假装他们被你的表现惊呆了，但千万别忘了这只是你的幻想，不是他们的
11. 要是他们没有聘用你，就不要帮助他们解决问题。咨询是一门在他人请求时去影响他们的艺术
12. 别奢望自己什么都能搞定，顾问得靠客户来执行想法
13. 铺的越广，摊的越薄
14. 大部分时间，在世界大多数地方，不管人们多努力，都不会发生什么大事情，大部分努力都是徒劳的
15. 头号问题解决了，二号问题就升级了，总会有另一个问题出现
16. 要是不能接收失败，做顾问就永远不会成功
17. 确实有顾问成功了，所以失败肯定是可以应付的
18. 在任何情况下都能找出问题，这样的能力是顾问最宝贵的财富，也是职业病
19. 能解决问题的人确实过得很好，但能有意识无视问题的人过得最好
        
第二章：培养似是而非的思考框架
二、培养似是而非的思考框架：顾问不能直接答应，要谈条件，做任何事情都是有代价的
    大多数人都按照逻辑行事，真正需要顾问的时候就是逻辑不管用的时候，就是两难或者矛盾的时候
1. 似是而非，不要理性，要合理。
   并不是所有矛盾都能够或应当有个解释的。
   当客户开始变得没有逻辑的时候，理性的顾问总是会犯错。 --- 自以为无所不知的人最容易上当。
   认为自己是百事通的人最容易被愚弄，生活是如此重要，所以不必太认真。
2. 折中处理，你什么也不付出就什么也得不到。
             不付出就什么也得不到
   在一个方向上运动必然会导致在另一方向上的消耗。
   提升一方面，就要牺牲另一方面。
   顾问带来的是改变；无法拒绝去解决问题只是咨询顾问的职业病之一。 最严重的职业病是所谓的优化强迫症。
   2.1 给我们用最低的成本解决
   2.2 在最短时间内搞定
   2.3 我们必须尽可能以最好的方法完成。
   那你愿意牺牲什么呢 VS 好的，老板。我马上去办，老板。
   除非你掌握了折中思考的艺术，并学会应对同时出现的折中，否则你永远成不了一名健康的顾问。
   当前的确定性和未来的不确定性之间求的平衡的问题。我要是明确地知道以后需要什么，也就没有这种的问题了。
3. 费舍基本定理，你越适应，你的可改变能力就越差。 -- 你越适应现状，就越难适应变化。
   3.1 一个生物体越适应当前的环境，就越可能难以适应未来未知的环境。
   3.2 如何招聘新人? 雇佣对某一技能更有经验的年长的人士，还是雇佣更能灵活学习未来所需新技能的年轻人?
       人们经常高估获得一项新技能所需的时间。也许他们考虑的是最优的表现，而不是合理接近最优的表现。
   3.3 制定培训方案? 更好地完成当前工作的培训，还是更能灵活适应未来工作的培训?
风险还是确定性：大多数人选择确定性的事情来干；同时拒绝不确定性的事情来干。
4. 第三次的魅力，顾问总是在你给他的第三个问题上最有效果
                 顾问一般在解决你提出的第三个问题时最有成效
   顾问不太适应当前的环境，所以他的适应能力可能更强。他们对于"现在还是以后"型折中的看法和当局者不一样，
   这让他们成了宝贵的想法源泉，同时也成了不可信任的人。
5. 橙汁测试，我们能做这件事一一这是所需的费用

1. 为什么似是而非——不要理性，要合理；
                  认为自己是百事通的人最容易被愚弄；
                  矛盾的世界里每个人迟早要跌倒，要想幸存于世就要嘲笑一切，并适时地跳过他，
                  要知道：生活是如此重要，所以不必太认真。
2. 优化和折中处理——根据对跑步世界纪录的科学研究，速度和距离的关系图为向下倾斜的曲线，
                  你想同时保持速度和长距离是不可能的；你什么也不付出就什么也得不到——折中处理。
                  所以在一个方向上运动就必然会导致在另一个方向上的消耗。
3. 时间的折中——花粉和蜜蜂：如果花粉太少，蜜蜂就不来，如果花粉太多，蜜蜂就不会去寻找别的花，也就无法传播花粉；
               同样的事情会在时间，地点，因素等方面进行折中。
4. 费舍基本定理："对现在越适应可改变能力越差"。只能寻求最合理的、近似最优的而不是最优的结果。
                顾问很少适应现在的环境，因此更具有潜在的适应性，他们就成了对现在环境的有价值思想的来源，
                但也使得人们对他们产生了不信任。"顾问总是在你给他的第三个问题上最优效果"——第三次魅力。


第三章：在不知道自己在做什么时保持高效
    当你不知道自己在做什么的时候，要有成效：有个好心态，不要以为自己一定能解决客户的问题，
至少对于最初当顾问的我很受用这个道理.
1. 医学上的第一大秘密，在所有疾病中，90%会不治自愈——完全不用医生的救治。
                       百分之九十的病都会自愈，根本用不着医生插手。
   1.1 没有自愈能力的身体设计都很快自行消亡了。归根结底，我们每个人都是无数幸存者的嫡系后裔。
   1.2 马文第一大秘密，对能够自我治疗的系统要温柔地处理
                       要温柔地对待能够自愈的系统
   1.3 工程第一法则，如果它自己没坏，就不要去修它
                     没坏的话就不要修
2. 马文第二大秘密，反复治疗一个能自愈的系统将最终产生一个不能进行自愈的系统。
                   反复治疗一个能自愈的系统会最终让他不能自愈
   2.1 对于那百分之十不能自愈的疾病来说，青霉素或其他的抗生素又可以轻松解决其中的百分之九十。
3. 马文第三大秘密，每一个处方都有两个部分：药物和确保药物正确服用的方法。
                   每个处方都包含两部分：药品和正确使用它的方法。
4. 马文第四大秘密，如果他们以前做的没有解决问题，那么告诉他们做些别的试试。
                   如果已经做过的事情没能解决问题，就告诉他们做点别的。
5. 马文第五大秘密，确保他们付给你的足够多酬金，以让他们能照你所说的去做，咨询中最重要的就是确定正确的酬金
                   务必让他们付给足够多的钱，这样他们才会照你说的去做。
   5.1 咨询中最重要的活动就是开出正确的加码。
6. 马文第六大秘密，不要太早放弃治疗，也不要坚持一种疗法太久。 
                   来得好不如来得巧
   6.1 知道如何不如知道何时。
   6.2 来得早不如来得巧。
7. 伯登规则，如果你不能修改，那就把它作为特色 --- 要是你不能改掉缺点，就把它变成特点。
   咨询的目的不是让我看起来高人一等，但也不能让我看起来愚蠢不看。咨询不是要考倒顾问，而是要为客户提供服务。
   交谈之中保持理性：失去理智又能恢复理智。
   二手车推销员：车旧点的 - 古典式； 特别吃油 -- 私人奢侈款； 旧货 -- 曾被拥有或经历丰富。
   打官腔：大国的总统不愿意承认自己的错误或者去挽救局面，于是告诉自己的人民，战争是重建民族意志和消耗
           过时武器的最好方法，而且还可以顺便演练新武器。
           我们赢得了战争。
8. 镀金法则，如果你不能以之为特色，那就粉饰之。
   8.1 要是没法当成特点来宣扬，那就冒充一点。  --- 缺什么补什么
   8.2 一旦糊弄过去了，我们就不再去学习如何真正解决问题了。
9. 逆粉饰规则，如果什么东西被粉饰了，那它肯定需要改善。 -- 所有镀金的东西都得改正
   9.1 成本效益分析 -- 成本分析
   9.2 程序中的bug -- 错误或者差错
12. 顾问不是完美的，不是什么问题都能解决的，有时候需要假装成功，打官腔，或者粉饰，但是如果一旦糊弄过去了，顾问就不再去学习如何真正解决问题了，这也是危险的

第四章：看到哪里有什么
四 看看那里有些什么：追溯历史，获取足够多的信息，然后透过现象看本质
1. 锤子法则，在圣诞节收到锤子做礼物的孩子会发现每样东西都需要敲打。
   1.1 手里只有锤子的专员可能最后只能用锤子敲螺丝钉了。
   1.2 按图钉技巧
2. 白面包警告，如果用相同的工艺，将得到相同的面包 --- 如果你用同样的做法，就会得到同样的面包。
3. 伯丁回溯原理，使事情按照它的方式运作，因为它们以前就这样。
                 事情是一步步变成现在的样子的。
4. 斯巴克斯解决问题法则，偶然解决了问题会妨碍我们找出谁是问题的制造者。
                          你越接近找出造成问题的人，解决问题的机会就越小。
   4.1 哪些造成问题的流程中涉及的人员还在，也还会以这样或那样的方式参与并试图自己解决问题。
   4.2.1 当时有很好很充分的理由来做出今天看起来十分愚蠢的决策；
   4.2.2 罪魁祸首现在已经成为你的客户，或者是你的客户的老板。
   4.3 你越接近找出造成问题的人，解决问题的机会就越小。
   4.4 为了避免落入指责别人的常见陷阱，你需要几条准则来指导自己对历史的研究: 
5. 研究指南，要简单化，不要太详细；你是顾问，不是律师。
   5.1 为了解而研究，而不是为批评而研究。
   5.2 对于现在已成为待解决的问题的状况，该对此负责的人情绪很自然会比较敏感，因此建议进行的任何改变都可以被看做对其人格、智商或远见的鄙视。
       他们很可能愿意通过交谈来解释他们的处境，但如果你起来是在批评，他们就会闭上嘴。
   5.3 找找在现在情形中你所喜欢的，并对此加以评论。 -- 在现状中找到你喜欢的东西并加以赞美。
   研究指南：
   5.1 保持简单，不要太详细；你是顾问，不是律师
   5.2 研究是为了理解，不是为了批评
   5.3 在现状中寻找你喜欢的东西并加以赞美
6. 为什么这样，我们有可能耗尽能源、空气、水和食物，但我们永远也耗不尽理由。
   6.1 你的系统为什么这么搭
       为什么要在七月一号前做这个改变
       为什么你的组织是这样运营的
       为什么你不多用用那台机器呢
       你为什么拼命用这台机器呢
       你的表格为什么需要这个信息呢
       它为什么不需要那个信息呢
7. 标签法则，大多数人买的是标签，而不是商品。
             事物的名字并不是事物的本质
    7.1 任何咨询问题都是一个道理。我能的顾问不懂得深究问题，只能用头脑中浮现出的第一个词给它贴标签，
    可能是试图隐瞒问题的提供的镀金标签，也可能只是描述情况中最显而易见的方面的标签。一旦这种脸谱化
    的标签变得根深蒂固，问题就会越发难以解决。
    7.2 维护还是设计 --- 设计方式和维护能力不匹配
    7.3 乐观主义者说：这个世界是所有可能的世界中最好的。悲观主义者叹了口气说：你是对的。
    7.4 每个标签都试图帮人们的注意力从项目的一个方面引开。 预算 -- 超支
8. 三指规则，当你用一个手指指向别人时，注意另外三个手指所指的方向
             你用一根指头指别人的时候，看看另外三根指头指在哪里
9. 五分钟规则，客户总是知道怎样去解决他们的问题，并总是在最初的五分钟里讲出解决方法。
               客户永远都知道怎么解决自己的问题，并且会在头五分钟里讲出来。

1. 顾问要去了解历史，事情是一步步变成这样的，要了解当初怎么做的
2. 研究历史是为了了解，而不是批评，在研究中找到你喜欢的东西并加以赞美
3. 越接近找出造成问题的人，解决问题的机会就越小
4. 任何事情都能找到理由
5. 我们大多数人买的是标签，不是商品，事物的名称并不是事物本身
6. 无能的顾问不懂得深究问题，往往根据客户的"表面"词语就下了一个结论，当这个结论落实下去后，问题就更加难以解决。一个问题，管理人员说"超支"，程序员说"预算不足"
7. 访谈的前五分钟，客户一定会说出自己的解决办法

第五章：看到那里没什么
    这一章主要讲固化一些框架，发现缺失，若无法发现则可以群体头脑风暴or换个角度再看: 解决客户认为重要的问题
    如果你不是聪明绝顶，那不如做个好的倾听者。
1. 积攒一些方法论，思考时以此为纲，保证完整性；或者固化下来自己的一些checklists
   1.1 按图顶板法：不仅展示了哪些问题存在或者不存在，还显示出哪些问题引起了多少麻烦。
   1.2 平均定律：高效的问题解决者可能有很多问题，但很少会有某一个特别重大的问题。
   1.3 缺失的解决方案：如果客户有一个突出的问题，就意味着客户缺少了一样更为重要的东西--把问题按照严重性排序的方法或策略。
   1.4 缺失的历史：看问题不仅要看分布，还要看分布的历史变化。
       如果突出的问题是最近才出现的，那有可能是由于突发的外部事件引起的。
   1.5 缺失的帮助：在我们这行，一个最大的讽刺就是最需要帮助的人很少向顾问求助。要是你恰好就在旁边，
                   有时候会情不自禁想要帮助，虽然没人要求。千万不要！要是没有求助，很可能你也帮不上忙。
如何找到少了什么?
意识到自身的局限。--- 找到你经常漏掉什么，并设计一个工具保证你不会再漏掉它。
利用他人。 --- 每个工具都包含两部分，工具自身的功能和对工具的管控管理。
研究其他文化。 --- 公司之间，
利用洗衣单。 --- 有时候，明确地列出可能缺少什么东西，会比依赖自己的记忆更好。
检查流程。 --- 虽然好的流程也不能保证你看到所有东西，但不好的流程几乎可以保证你会漏掉点什么。任何现在流程不佳的征兆都预示着新的流程应该比较有效。
1.6 温伯格离奇定律：有时候觉得离奇只是因为眼界不够。
  一个人要是想永远正确，就很难看到自己思维流程中的缺漏的东西。
  要是你想不出计划中可能出现的三处问题，你的思维肯定是哪里出了问题。

2. 让你的思维放松 -- 头脑风暴，头脑写作和游戏。
2.1 寻找相似：
2.2 推至极致
2.3 越过边界
2.4 寻找借口与寻找解释：
    为了你的安全，请注意浴缸的高度。
    禁止使用某些特定的代码组合来标识产品。
    很多成文的规定都是为了快速修补过去发生过一次的事情而设立的。那个故事可能已经被人遗忘了，但是规则还在，提醒一种可能再次发生的情况。
3. 对不一致的洞察力：语言和音乐不搭配的时候就指出了一个缺漏。
4. 布朗的天才遗产：语言经常很有用，但听听音乐总有好处，特别是你自己内心的音乐。
5. 学会让自己放松下来，获得灵感，寻找解决办法

1. 遗失的工具——如果你不是聪明的一塌糊涂，那么做一个好的听众是有好处的。当你关注问题的时候，也要花一定的精力
   寻找他的优点以便于你自己的学习。不能热衷于找"问题"，而忽略了"没有问题"。
2. 从不存在的东西那里寻找原因——年轻的顾问总愿意为自己的注意而骄傲。我自己创造的东西很少，我应该了解这一点才行。
   有效的问题解决者可能有很多问题，但很少有一个占统治地位的问题。
——如果客户有一个很突出的问题，那就表明他们遗漏了一些重要的东西
——按照问题的严重性排序的解决方案和策略。最好从开始就忽略大问题，建立客户自己解决问题的机制，这样也会增加他们
  的信心。不但要看问题的分布情况，而且要看其分布的历史变化。忽视对帮助的需求；不要提示客户提出需求，也不要去帮他。
3. 怎样看到那里所不存在的——找到你经常遗漏的东西，并设计一种工具以确保你下次不会再遗漏他。
——完善自我。利用其他人的观点去看，补充盲区。
    关于荒谬——如果一个东西过于合理，那它就太保守了。有时候觉得牵强只是因为短视。"如果在你的计划中你不能想出
三个有可能出错的地方，那么你的想法中就有什么地方出错了。"它将在你认为"确定无疑的事"上为你节约大量金钱。
    放松你的思维——寻找相似物；推至极致（夸大法对现有情况进行分析）；看到边界线以外（事物容易掉进裂缝中，
它产生在两个系统相交的边界上）；寻找托辞与寻找解释（托辞可能就是问题所在）；情感成分（理智）：不一致洞察力
（当语言和音乐不协调时，他们指出了被忽视的东西）。
    布朗的光辉遗产——语言通常是有用的，但总要和音乐一起来听（尤其是你自己内心的音乐）。


第六章：避免陷阱
    这一章主要讲如何利用checklist、外力或者潜意识让自己避免错误
    你应该对如何让客户远离麻烦以及如何让自己远离麻烦有所了解。
    避免麻烦——我的大部分麻烦都产生于相同的根源：我自己。
    主管线格言： -- 你不知道的事也许不会伤害你，但你记不起来的事却总能伤害你。
                 -- 你不知道的东西可能不会到你，但你记不得的东西肯定会。
1. 以为灾难不可能发生往往会导致不可想象的灾难----泰坦尼克效应。
2. "主管线"格言：你不知道的东西可能不会伤到你，但你记不得的东西肯定会。
3. 设置提示物的艺术：作为顾问，你需要既能把提示物放进自己的脑子里，也能把它放进客户的脑子里。
    你能提供的影响最深远的服务，就是帮助人们远离他们早已知晓的麻烦。
    薯片原理：如果你了解你的受众，就很容易设置提示物。
4. 一句话笑话
    4.1 你不知道的东西可能不会伤到你，但你记不得的东西肯定会。
    泰坦尼克效应：以为灾难不可能发生往往会导致不可能想象的灾难
5. 设置客户或者自己喜欢的提示物提醒自己：便条、记录卡、提示卡、物理设备、他人、信号、相互提示的约定。
6. 利用自己的潜意识:歌唱家、潜意思的局限、看看你的头脑深处

第七章：扩大你的影响
这一章给出一些具体action来扩大顾问的影响
    每个人都看到整体的一部分，并用那一部分认知整体 -- 教导盲人
    顾问的求生背包——员工不能了解主管的全部工作。
    晃动定律或干预第一定律： 少即是多
1. 主管不被人认可，是因为大多数工人对主管真正在干啥一点概念也没有。
2. 任何运行在过度受控和可预见的环境中的大型复杂系统都可能卡壳。任何外来的、不可预知的且不具威胁性的人员都可能让组织晃上一晃。
2.1 因过载而卡壳
2.2 沟通卡壳 -- 顾问不太适应当前的环境，所以更容易引起晃动。
             -- 少即是多
3. 在进行咨询时，我一般会把整个组织转一遍，有可能的话，还会让一个部门的人陪我去下一个部门。反馈来的信息常常是：
偶然拜访另一个部门是我整个行程中最重要的部分。
你越是努力遵守建议，就越是会违反它。
4. 要加快会议的方法就是保持安静
5. 顾问只要跑的比客户快就行
6. 顾问的成功取决于正确的实际
7. 小技巧：客户都害怕说出真实的想法，顾问是中立者，可以不出卖任何人，可以采用匿名等方式引用客户的叙述，所以要鼓励客户说出自己的感觉
8. 打开客户的眼界，交给他们看待事物的新方式，引导客户看到更远更高不一样的眼界（这句话让我想起了张晓杨朋友圈里的一句话：let us step back a bit and try to see the bigger picture）
9. 大牛顾问：
9.1 你的任务是去影响他人，但只是在他们要求时才去做
9.2 你努力让人们更少地而不是更多地依赖你
9.3 如果客户希望你帮忙解决问题，你能说：不
9.4 如果答应帮他们解决问题但失败了，这也还可以接受。如果你成功了，满意度最低的办法就是你为他们解决问题。
9.5 更令人满意的办法是，帮助他们解决问题，当让他们更加可能无需帮助而自己解决下一问题。
9.6 最令人满意的是，帮助他们了解如何在一开始就预防问题
9.7 你可以对你的成就感到满意，即使客户并不归功于你
9.8 理想的影响力形式是首先帮助别人更清楚地看到他们的世界，然后让他们决定下一步该怎么做。
9.9 你的工作方法可以随时向客户展示并进行讨论
9.10 你的头号工具仅仅是做你自己，所以最有效的帮助别人的方法就是帮助自己。

1. 模范顾问往往通过自己的存在就可以影响别人，即使别人并没有要求获得他们的影响。
2. 走在你客户的前面——只要你比别人跑得快，就不会被熊吃掉。你需要比客户跑得快，必须放大你的影响，
   用最小的力量是你的对手去工作。因为你花在咨询工作对象的时间比客户要少得多。
3. 摇动粘滞的系统——一个组织，一个功能会慢慢变得粘滞，需要来自于系统外的摇晃。作为顾问，你不能陷入这个系统。
   你是一个摇动器(jiggler)，不是顾问，你要使事物摇动，使自己以不同的水平来同组织一起工作。尽量把组织变得
   能够自己摇动自己。"来自于局外的人，任何人都可以就其所关心的问题同他进行讨论"。当你过多的和问题联系的时候，
   你的摇动作用会变小。因此"少即是多"。对客户观察世界的方法进行微小的修正就可以了。
4. 教授盲人——沟通前，要分享彼此的体验，对多个部门进行拜访，了解情况，或者通过跨部门的会议。对于一个大系统，
   通过某个特定的人群去完成对他整体的了解有困难，你需要听取多方面的建议。改变感知，不要想河马——你越试着遵守他，
   你越违背他——无语言行为，改变意识，看内部行为，看感觉。可以试着用两种不同的态度——红帽子——（肯定和否定）的
   方式来看待一个问题。
5. 有力的顾问——作为触发物，你要去影响别人，但仅限于在他们的请求下；尽力让人减少而不是增加对你的依赖；试着遵守
   摇动器规则：你实际介入越少，你对工作的感觉越好
6. 营销大师用小锤敲一个大的重物，轻轻的敲击；如果你的客户在解决问题时想得到帮助，学会说不；
   任何人更喜欢在没有帮助的情况下解决下一个问题；
   最令人满意的是帮助他们学会怎样首先避免出现问题；
   你可以对自己的成果感到满意，即使你的客户没有给你赞许；
   你获得影响的思维形式应该是首先帮助别人更清楚的看轻他们的世界，然后让他们决定下一步怎么做；
   你的工作方法总是能够公开展示出来，并能和你的客户讨论；
   你的基本工具是你自己，你能帮助别人的最有力的方式就是提高你自己。


第八章：学会控制变化
    这一章主要讲Speakout把自己做的微笑的改变讲出来，想要有影响，就要真正解决客户的痛点，将生命放入其中以保证质量
    顾问的工作就是通过让客户把小小的干预逐渐放大来完成的。
1. 有些时候，在某些地方，会发生重大的变化，特别是人们没有努力去改变它的时候。
   变化到底是怎么发生的，以及可以做些什么来阻止它。
   变化第一定律： 黄瓜被卤水腌的多，卤水被黄瓜染的少。
2. 普雷斯科特腌黄瓜原则：如果小系统试图通过长期和持续接触来改变大系统，那么最后更可能是自己发生变化。
3. 流浪者法则：努力留在家会让你变成流浪者。  得到自己想要的，失去自己拥有的。
4. 留守者法则：努力去旅行会让你变成留守者。
5. 罗默法则：失去一样东西最好的办法就是努力留住它。
6. 快餐谬误：没区别加上没区别加上没区别... ... 最后等于很大的区别。聚沙成塔，集腋成裘。
   最大最持久的变化，常常源自于试图保持最终改变最大的那样东西。
7. 福特基本反馈公式：人们可以从任何一条河流里取随便多少水并用于任何目的。人们必须把等量的水还回取水处的上游。
8. 温伯格测试：你愿意把自己的生命托付给这个系统吗？
   温伯格测试的基本要素，就是要求说话的人要压上自己的东西，而不光是空泛泛地夸夸其谈。
1. 胳膊拗不过大腿，所以别试图根本改变
2. 试图保证质量的顾问应当首先看看负责质量的人到底是不是在质量的下游。作出恶行的人常常并没有意识到他们自己的行为。冷漠的官僚一般都出现在那些永远不会使用自己提供的服务的机构——客户不急着改变，则顾问再急也没用
3. 客户认为顾问不用承载自己给出的建议的后果

改变的力量——流浪者规则：为了能留在家乡而努力奋斗会使你成为流浪者。你需要去外边挣钱保持你留在家里的资本。
            留守者规则：为了能旅行而奋斗会使你成为留守者。
            因为嫉妒产生的暴怒隔离了爱，过分占有导致了分离。
            游守规则：失去的最好方法是努力保持。
    试图经过长时间的接触去改变一个大系统的小系统，其本身更容易被改变。作为顾问，不应该华太多时间在一个客户身上。
改变需要时间和不断的接触，对你的挑战就是怎样使客户和某种盐水保持长时间的不断接触，甚至在顾问不在场的情况下。

    普瑞斯科特腌菜原则——是黄瓜变得更像腌菜，而不是盐水变得更像黄瓜。事物对环境的作用，这有悖于孤军奋战就能战胜
"整个系统"的浪漫观念。腌菜店随着人们的意见而变更了它的产品


第九章：如何安全的进行改变
    这一章主要讲如果必须发生改变，则尽量同时只改变一种，而且尽量在"闲时"。改变一定要有backup方案。
当改变发生问题时，要尽早直面问题，解决问题，而不是藏着
1. "新"的定律：新玩意儿从来就不好使。
2. 潘多拉的疹子 ：新玩意儿从来不好使，但我们总是希望这一次会有所不同
3. 不能同一时间启动太多不同的东西，要一点点来——新东西一定会有问题
4. 发牌员的选择：信任每一个人，但要自己来切牌；他们(客户)想试什么就试什么，不过要教他们如何保护自己。
5. 新的系统必出故障，而且可能会出好几个故障；如果新系统不可能是完美的，我怎么使用才可以让它比现在的更好呢？改进比实现完美更容易。
6. 埃德塞法令：如果必须搞点儿新东西，那么只要一个，不要两个。
7. 大众汽车真理：如果你不能拒绝它，就去化解它。
8. 时间炸弹：时间会击破所有弱点。换句话说，浪费时间的最可靠的方法就是扔掉谨慎。
9. 隆达第一启示：它可能看起来像一场危机，但实际只是幻觉的破灭；
10. 隆达第二启示：当变化无可避免时，我们会尽力保持最看重的东西；
11. 隆达第三启示：当你建立一个幻觉来防止或减弱改变的时候，改变就更可能发生，也更难于接受。

1. 潘多拉疹子——没有新东西会好用（系统、疾病、设备等）；但人们总是希望这次有所不同。
2. 与失败共存——发牌者的选择：信任每一个人，但还是要切牌；让他们是他们所想的，但交他们怎样保护自己；
3. 接受失败——接受新事物要忍受它的失败；用改善替代完美；应用三的规则找到被容易忽略的事情；使用被用物。
4. 预防药物——大众真理：如果你不能拒绝，那就试着去适应。浪费时间的最有把握的方式是把警告当耳旁风。
5. 隆达的启示录——这也许看起来像一场危机，但这只是错觉的结束；当改变不可避免的时候，我们应尽最大努力
   保持住我们最珍视的东西；当你创建一个错觉来防止或者减弱改变时，改变会变得更容易——并且令人更难以承受了。
   ——要让你的客户面对真相。我们投入到保护错觉的经历使危机加重了。

2. 与故障共处：接受故障，持续改进，有常用问题解决办法，有backup方案
3. "闲时发布"尽量减少犯错成本
4. 将新事物拆成几个部分，以便逐个采纳
5. 你应当鼓励客户尽早面对真相。如果你真的在乎"保护"别人，那么永远不要让他们"免于"见到真相。真相可能会让人受伤，但幻觉会让人伤得更深

第十章：遇到阻力怎么办
    这一章主要讲面对阻力，要引导客户说出原因，和客户一起找出他们真正关心的问题，
 再商量如何解决，哪些能变，哪些不能变，需要什么代价。预先明确客户意图、关注点，减小阻力发生几率
1. 欣赏阻力
   如果客户丝毫不抗拒你的想法就太可拍了，因为这就把全部责任都押在你必须永远正确上面。
2. 阻力就像真菌，不会在阳光下茁壮成长。因此，一旦你怀疑有阻力存在，就应该让他公开见光，而不是在暗处溃烂
   2.1 注意非语言行为，他或具有防御性，或具有攻击性，这取决于你对阻力的看法：
       防御性行为：远离、看别处、摇头否定、交叉双臂或双腿、过度微笑、打哈欠
       攻击性行为：用手指指、向下看、摇头肯定、挥挥动拳头、过度皱眉、连续敲击。
   2.2 我经常发现自己在说"我"或"你"而不是"我们"，或者用"家长式"的口吻说话。
   2.3 他们的行为：我需要更多的细节；你需要更多的细节。
                   现在还太早了；现在台湾了。
                   实际情况不是这么回事；我对他有一套理论。
                   从来没试过这个；这是老一套。
                   我没问题；我有太多的问题。
       为了阻止这些变化，我什么话都肯说。
       指责别人只会使问题得不到解决，所以找替罪羊是行不通的。
3. 用中性的方式称呼阻力：不要指责谁解决不了问题，而是用中性的方式面对阻力，摆在台面上共同解决
    3.1. 我相信不需要这个信息也可以进行下去，我建议先看看我们已有的东西
    3.2. 我们没有取得预期的进展，我们该怎么解决
4. 要知道客户到底要什么，才能解决问题，如果永远给他不想要的，则永远解决不了问题
    4.1. 他根本就支不动她，知道他找到了她想要的东西。一旦做到了这一点，不到一分钟，一切就都解决了
    4.2. 顾问要做的就是把我想说的和他们感兴趣的联系起来
    4.3. 要是更在意我想要的而不是客户想要的，我就不能成功的运用它。你觉得我应该明白对方更在意他们想要的而不是我想要的
    4.4. 水牛的缰绳：你可以让水牛去任何地方，只要它们想去；你可以让水牛不去任何地方，只要它们不想去。
    4.5  阻力就像顾问身上的标签，而客户身上的标签则是安全。人们做一件事，是因为他们觉得获得比失去的更多 -- 阻力。
    4.6  揭示潜意识的阻力来源的一种很好的方式就是测试一下替代方法有多大吸引力。
5. 寻找阻力的源头，和客户一起把问题都列出来，这个过程中会发现，顾问和客户认为的有偏差，所以通过这个过程要达成共识
    5.1. 给出替代方案，并考量每个替代方案的吸引力即可接收程度
    5.2. 如果仙女让您给这个计划许一个愿，您会许什么呢？——幻想方法
    5.3. 如果客户无法找出阻力，另一个矛盾的办法就是强调积极的一面。你最喜欢这个计划里的哪一点，其次最喜欢哪一点
    5.4 与客户合作可以把潜意思因素摆在阳光下。客户往往会高估那些没有明说的负面因素。
    5.5 有时候，我认识的好处对客户来说并不重要；而另一些时候，客户会把一些好处看得比我想象的还要重要得多。
        我对好处的看法并不重要，
6. 预防阻力
6.1. 我们开展这个计划的时候，有那件事情是你确定不要改的吗?
     你也可以把整个重点从改变转向不变，也就是从客户希望发生什么转向客户不希望发生什么?
6.2. 由不确定性导致的阻力可以用降低风险的技巧来克服，例如需要额外增加一些事情，则需要争取更多的时间
     保险的形式：如果你害怕的事情变成现实，那我就会做出弥补。
6.3. 我们目的是为了解决问题，所以要避免双方僵持
6.4 我的目的是帮助客户解决问题，而不是展示我智商超群或意志坚强。

    绕不过阻力的时候，我尽量不把它当作是针对我的。要是认为阻力是针对我的，客户要么会继续抗拒，
要么停下来来取悦我，而这绝对是一个错误的理由。僵局达到一定程度的时候，最好干脆放手然后宣布：
"恐怕这事情对我来说太大了，我希望你能解决它，但我想不出别的什么能够帮到你了。"


第十一章：推广你的服务
    这一章主要讲如何获得更多生意，从已有客户上挖掘机会，让客户帮助宣传你的成果；发展几个关键客户，
给自己点空闲时间思考，重质而不是重量
1. 营销第一定律：顾问可以有两种状态：状态I(闲，Idle)或状态B(忙，Busy)。
2. 营销第二定律：最好的找新客户的方式是有客户。
                 每个人都愿意跟着赢家。没有什么比真诚地拒绝额外的工作更好的营销手段了。
3. 营销第三定律：每个礼拜至少花一天时间来曝光自己。
4. 营销第四定律：客户对你总是比你对他们更重要。
5. 营销第五定律：永远不要让一个客户占到总业务的四分之一以上。
   琳恩生存法则：作为顾问，为了能对自己说"是"，你要能对任何客户说"不"。
6. 营销第六定律：最好的营销工具是满意的客户。
7. 营销第七定律：把最好的想法送人。
8. 营销第八定律：自己加了个蛋之后味道更好。
                 扼杀了客户试图参与解决自己问题的尝试。
9. 营销第九定律：至少留出四分之一的时间什么也不做。
9.1 如果你的时间排的满满当当，你就没办法在突然出现新业务机会的时候抓住它；
9.2 虽然你不想对现有客户的每一个个命令都立刻跳出来做出反应，能够对真正的紧急事件迅速响应也是服务的一个重要方面
9.3 人吃五谷杂粮，你也会出故障，遇上暴风雪啦，摔断了腿了。要是日程一点余地都没有，这就可能让你无法履行承诺
9.4 你是你自己为的产品：要是没有休闲的时间来充电，你很快就会筋疲力尽或思路枯竭。不管哪种情况，你都不会大卖。
9.5 练习什么也不做可以帮助你学会不给客户太多。
10. 营销第十定律--夏洛特定律：为质量营销，而不是为数量。


第十二章：把价签贴在脑门上
    这一章主要讲谈一个合理的价格，让自己觉得合理不亏
    人们知道每件东西的价格，却根本不知道他们的价值。
1. 定价第一定律：定价有很多功能，金钱的交换只是其中一个。
2. 定价第二定律：付给你的钱越多，对你的爱就越多。付给你的钱越少，对你的尊重就越少。
   2.1 价格就是一个重要的筛选器，如果你觉得自己配得上你的要价，你就可以告诉客户，
                                 如果屈就了他们的价格，他们也不会尊重你
3. 定价第三定律：钱一般是价格中最小的一部分。
   让客户付出一些对他们有价值的东西，即使没有付给你，你也实际上提高了价格。如果他们付出了一些东西才把你弄到那里，
4. 定价第四定律：定价不是一个零和游戏。
5. 定价第五定律：如果你需要这份钱，就别接这个活。
   如果你拼命想要业务，最好的办法可能就是免费提供服务。
6. 定价第六定律：如果他们对你的工作不满意，就不要拿他们的钱。
7. 定价第七定律：金钱不是价格
   7.1 设置分阶段费用实际上是告诉客户，我不太确定自己是否理解的问题。在这种情况下，第一阶段常常就是把问题定义
   清楚，大多数客户能理解，如果不知道问题是什么，就没办法报价。
8. 定价第八定律：价格不是一件物品，它是谈判达成的关系。
9. 定价第九定律--最小遗憾定律：设定的价格应该让你不论谈没谈成都不后悔。
   9.1 设定的价格应该让你不论谈成没谈成都不后悔，一个我愿意为之工作的价格，但再低就感到不爽的价格
10. 定价第十定律：所有价格最终都是基于感觉的，你的感觉，还有他们的。
11. 价格最终都是基于感觉的，你的感觉，还有他们的。所以你觉得自己值多少钱，他们觉得你值多少钱


第十三章：怎样赢得信任——
    这一章主要讲了如下内容
    信任：对一个人的诚信或能力的坚定信心。
1. 信任第一定律：除了你自己，没人在乎你让别人失望的理由。
2. 信任第二定律：信任需要多年才能赢得，但只需一瞬间就可失去。
3. 信任第三定律：人们不再信任你的时候不会告诉你。
4. 信任第四定律：赢得信任的技巧就是避免所有的花招。
5. 信任第五定律：人是绝不会撒谎的--在他自己眼中。
6. 信任第六定律：永远信任你的客户，不过要自己切牌。
7. 信任第七定律：就算客户要求，也永远不要不诚实。
   如果你拒绝这样的请求，客户可能会记得你不肯合作；如果你对不诚实的请求妥协了，人家就永远记得你不可信。
8. 信任第八定律：永远不要做任何承诺。
9. 信任第九定律：永远信守诺言。
10. 信任第十定律：把它写下来，但还是要靠信任。

1. 别人可以按照自己的意愿形成对你的各种印象，源于你的行为，而不是话语，没有人听你解释
2. 人们不再信任你的时候不会告诉你，信任是可以在一瞬间打破的，则永远不可能再建立
3. 赢得信任的技巧就是避免所有的花招，保持最坦率的沟通
    1. 要是他真的消极的话，你为什么还让保罗留在这里糟蹋你的公司呢？
    2. 我相信你有充足的理由禁止我采访弗兰，如果你可以告诉我的话，会对我很有帮助
4. 信任的一般源于诚实，另一半源于能力。将未经证实的观点作为事实是得不到信任的
5. 信守承诺，否则不能承诺


第十四章：让别人采纳你的建议
    你不一定能解决客户的问题，但是努力很重要，掌握正确的方法，让客户参与其中找寻自生长能力
农场经验：
1. 永远不要用便宜的种子；                       [请什么样的人做什么样的事]
2. 精心准备土壤是所有园艺的秘诀；               [罗马不是一天建成的]
3. 时机至关重要；                               [环境和气候是重要的]
4. 长得最牢的是自己长根的种子；                 [靠天靠地靠自己]
4. 浇水太多会让它变弱而不是变强；               [磨练是好事]
5. 尽管你尽了最大的努力，有些植物还是会死掉。   [失败是成功之母]

    咨询这行当有多古老？有人说伊甸园中的蛇是第一个顾问，它告诉夏娃（还是正确地）上帝肯定不会
因为她吃了禁果而杀她。当然，蛇忘了警告她这有什么副作用
    如果你靠解决问题吃饭，特别重要的一点就是确定自己在解决正确的问题。
定义好问题可以帮助你正确的开始，而好的开始对顾问尤为重要

第十五章：回顾上述内容
关于解决问题：
1. 大多数的问题都会自己变好，所以要温柔对待能够自愈的系统，没坏的系统就不要用自己的方式去修。 因为他总会自己好的。
2. 反复去治疗一个可以自愈的系统会导致他最后不能自愈。所以不要反复去帮客户解决同一个问题。
3. 给建议还要去跟进他们实施的方法，也就是说给用户一个药还要看着他们按要求吃完。
4. 对已经做过的事儿如果没能解决问题，那就让他们换个方法做点别的事儿。
5. 务必让他们付给你足够的钱(正确的钱)，这样他们才会听你的。
6. 不要太早放弃治疗，也不要为一个疗法坚持太久。
7. 如果不能让客户改掉缺点，那么就去想怎么样能让这个缺点变成特点，然后去发扬特点。
8. 作为顾问重要的是用合理的方式去解决问题，而不是用所谓的理性的方式去解释问题。因为理性的方式别人都已经试过了。所以重要的是去尝试那些非常规的方法。
9. 普通人在遇到问题的时候脱口而出的是：好的，我马上去办
    顾问在遇到问题的时候，第一个应该说的是，那你愿意牺牲什么呢。做顾问必须了解折中的艺术，提升一方面，就必须要牺牲另外一方面。
10. 橙汁测试：我们能做，但是这是所需的费用。只要一个客户需要服务，就要去问他们想要得到什么，然后告诉他们需要多少钱，然后来评估彼此的价格是否吻合。

研究指南：
     1）要简单化，不要太详细；你是顾问，不是区域代理
     2）为了解而研究，而不是为批评而研究
     3）找找现在情形中你所喜欢的，并对此加以评论
     为什么会这样：我们有可能耗尽能量、空气、水和食物，但我们永远也耗不尽理由
标签法则：大多是人买的是标签，而不是商品；事物的名字并不是事物的本质
三指规则：当你用一个手指指向别人时，注意另外三个手指所指的方向
五分钟规则：客户总是知道怎样去解决他们的问题，并总是在最初的五分钟里讲出解决方法
程度规则：有效的问题解决者可能有很多问题，但很少有一个占统治地位的问题。
温伯格牵强法则：有时候牵强只是因为短视。

三的规则：如果你的计划中你想不出三个有可能出错的地方，那么你的想法中就有什么地方出错了。
不一致洞察力：当语言和音乐不协调时，它们指出了被忽视的东西
布朗的光辉遗产：言语通常是有用的，但总是要和音乐一起来听（尤其是你自己内心的音乐）

管道格言：你不知道的事也许不会伤害你，但你记不起来的事却总能伤害你
薯片原则：如果你了解你的读者，就很容易设置触发物
泰坦尼克效应：认为灾难不可能发生的想法经常导致不可想象的灾难
摇动的法则或干预第一法则：少即是多

普瑞斯科特腌菜原则：试图经过长时间的接触改变一个大系统的小系统，其本身更容易被改变
流浪者规则：为了能留在家乡而努力奋斗会使你成为流浪者
留守者规则：为了能旅行而努力奋斗会使你成为留守者
游守规则：失去的最佳方法是努力保持
快餐谬误：没有不同加上没有不同加上没有不同加上......最终等于明显的不同

福特基本反馈公式：人们可以为任意目的从任意水域取任意多的水。人们必须将相同数量的水返还到他们取水地点的上游。

温伯格测试：你愿意把你自己的生命交给这样的系统吗？
新东西法则：没有新东西会好用
潘多拉疹子：没有新东西会好用，但人们总是希望这次有所不同
爱得赛布告：如果你必须有新东西，那就只要一个而不是两个

发牌者的选择：信任每一个人，但还是要谨慎；让他们试他们所想的，但教他们怎样保护自己

时间炸弹：时间会伤害所有人；浪费时间的最有把握的方式是把警告当耳旁风。

隆达启示：
1）这也许看起来像是一场危机，但这只是错觉的结束
2）当改变不可避免时，我们应尽最大努力保持住我们最珍视的东西
3）当你创建了一个错觉来防止或者减弱攻击时，改变变得更容易——并且更难以承受了
水牛套勒：你能让水牛到任何地方，只要它们愿意去那儿
林尼生存法则：作为顾问，为了能对自己说是，就要能对任何客户说不


沟通技巧：
1. 做一家已经成熟公司的顾问，了解历史非常重要，这样就可以看到是如何一步一步演化到今天的。
   因为当时很可能有很好很充分的理由做出了今天看起来很愚蠢的决策。
   但是不要去批评问题，因为造成这个问题的人现在已经是你的客户，或者干脆是你的老板。
2. 但是记得不要太详细地去问，你需要从细节中自己去整理思路和发现问题，你是顾问不是律师。
3. 研究历史不要去批评，而要去找出好的点去赞美。
4. 永远不要去担心如何收集问题，"为什么"是收集问题的很有效的方式。但是往往来说客户都知道怎么解决自己的问题，
   并且会在头五分钟就给讲出来，这样可以避免自己陷入到无限的细节中去。

     
总体原则
1. 用户不会承认自己有问题，咨询要承认用户能干，然后去小步改进问题。咨询的第一要率就是10%承诺定律，承诺的太多会让用户觉得很难堪。如果真的改了10%以上，就要确保客户没有注意到他，确保没人注意的最好方法就是把这些功劳归结到客户身上，不要自己贪功。
2. 用户要找咨询的时候，往往不是做事情的方式不对，而是这个事儿根本就不对。另外，管理层不会承认是人的问题，往往会把这些归结为技术问题，但是不要拆穿这些事情。
3. 一定要让客户按小时付费，而不是解决方案付费。因为用户如果明确知道他要解决方案，或者你提出某解决方案，就是意味着告诉客户说他出了问题。不要指望客户承认某明确解决方案有效，因为这就意味着让客户承认他之前做的有问题，所以做咨询一定不要邀功。
4. 要是客户没有聘用你，你不要去帮他们解决问题。这对你的银行账户没有帮助，而且也不会成功。
5. 对于一个生意，铺的越广，摊的越薄。名和利大多人都只能选择一个。
6. 不要以为你可以一直解决客户的问题，所以不要按解决方案付费，因为解决了第一的问题，第二的问题就自动变成了第一的问题，所以这个解决方案永无止境。
        
        
咨询：应人们的要求去影响他们的艺术

第十六章：咨询的基本方面

A. 咨询的基本方面：
1）咨询的特点：咨询的本质，顾问和客户之间本质的竞争关系
2）合适的思维框架：选择不绝对理性、但是折中/平衡/合理的思维方式
3）有效的工作方式：问题解决能力 > 专业知识，正确地应对问题

B. 咨询过程的主要活动：
4）发现问题：利用有效的简单工具，通过听客户讲故事、研究历史、关注额外信号来获得关键信息
5）找到原因：观察问题的分布和历史变化，注意和寻找那些容易被忽视的东西
6）避免陷阱：找到使自己避免麻烦的一些方法，如规则、触发物、铃声系统，要注意无意识思维
7）扩大影响：顾问需要不断地扩大自己的影响力，如摇动粘滞的系统、教盲人看大象等，角色定位是"影响者 + 触发物 / 摇动者 + 辅助者"
8）控制改变：改变通常来自于稳定和维持的努力，控制小变化形成大改变，确保提要求的人用关乎个人利益的一些东西来冒险
9）促成改变：与改变共存，让客户试他们所想的，但教他们如何保护自己，帮助他们预防失败，鼓励他们尽早面对真相
10）应对客户抵制：欣赏抵制，发现抵制，用中立的方法使抵制公开化，找到抵制的根源，应对和防止抵制

C. 咨询服务的管理：
11）经营服务：营销法则——通过对业务数量、客户组成、自我营销、自我时间等的主动管理，确保持续的合适数量和高质量的咨询机会
12）定价：定价法则——通过合适的自我感觉，确定合适的价格，筛选不值得做的客户，以维持自己的合理身价和应有尊重，并且，可以利用金钱为成功咨询创造条件，通过不同方式增加自我补偿
13）获得信任：信任法则——首先信任客户，确保听到客户所说的信息，将隐藏的情绪公开化，对于可疑之处进行充分调查，拒绝不诚实的要求，维持既定承诺，以获得客户的信任，而不是在失去信任后不断地试图解释
14）让客户听从建议：培育最好想法，精心准备土壤，选择合适的时机，让想法自主发展和奋斗，并学会与失败共存   
        
        
        