团队管理的心得
1. 团队的流程建设;人才的梯队建设
2. 鼓励向上沟通。多进行内部沟通。
3. 安排任务的方法，总结的挺好：
第一，讲清楚目标与意义，我的期望与衡量标准;
第二，讲清楚做这件事对其个人能力成长有什么帮助;
第三，关于做事情的方法和思路，如何去做，做情景管理，因人而异;

总结:
1，完美之道，不在无可增加，而在于无可删减。在管理上，感觉很忙，琐事很多，而没有成就感，重要的事情没有做，
   是不是因为自己“做”得太多？确实要反思自己是不是管的太多，做得太多。关键还没有做到点上。所以要对自己的
   事情进行统计，看那些事情可以授权给别人完成，信任别人完成，给别人机会，不是把所有事情都抓在手里，这是
   没有安全感的表现。
2，关于及早发布，及早试错，对我们行业不适合。我们行业是企业市场，一个单子做不好可能丢掉的不是一个客户，
   而是一个行业。容不得我们犯错。
   
管理者的目标是提高整体的效率，而非自己解决问题
1. "当我编码的时候，是对公司贡献最小的时候。"
2. 研发负责人更重要的任务是提升研发整体的资源利用率。打造一个高效的研发团队。
3. 即时启动新的项目，明确项目目标，提升人力资源使用率，加强技术评审。
   