第零章 简述

成为领导不是靠运气，而是靠投入。

技术领导者的全面模型（MOT）：突出'选择'与'发现'
M：激励(motivation)——奖励或是磨难，用来激励或惩罚相关的人
O：组织(organization)——现实的组织结构，将想法化为实践
I ：头脑或创新(ideas or innovation)——种子，对未来图景的想象

子模型一：解决问题
1. 理解问题（understanding the problem）
2. 管理思维（managing the flow of ideas）
3. 保证质量（mantaining quality）

子模型二：创新
1. 创新的三大障碍
1）不能从旁观者的角度去认识自己。
2）没问题综合症（NPS），欺骗自己，以为早就知道所有问题的答案
3）教条主义，认为一个问题只有一种解决办法
 
2. 提升创新能力：
1)任何实际问题都存在另一个解决办法，只是目前没人知道；
2)创造性的错误：错误是机会，是想法
3)希望保密的想法通常并不值得偷窃，值得偷窃的想法通常是被客户认为无关紧要的想法
4)综合：将两人的争论综合成第三条路
 
子模型三——激励：始终真诚（无论是否刻意）
I 交流
1. 交流可能导致的结果
1）开创新的可能
2）强化旧的可能
3）激活生存规则
4）增强攻击性
5）加重痛苦
 
2. 交流的过程：假定消息的真正内容为A
1）感官接受（sensory input）：接受过程可能会丢掉一些信息，信息的表达内容也会受到信息表达方式的影响，消息变成了B
2）解释（interpretation）：根据自己的经历对B而不是A进行解释，结果是可能导致多种解释,消息变成了C
3）感受（feeling） ：对C产生了某种感受D
4）对感受的感受（feeling about the feeling）：对感受D的反应变成了E
5）防卫（defense）：选择是否进行防卫？选择哪种防卫方式？F
6）发表意见的规则（rules for commenting）：根据自己的一些准则决定回应内容G
7）输出（outcome） ：输出的消息H实际上掺杂了B-G

3. 导致交流发生问题的5个主要原因：
1）接受差异：双方没有以同样的方式接受表层交流，因为人不同，接受也不同
2）时间错误：转换涉及过去或未来发生的事情，这些事情与正在进行的交流没有逻辑关系
3）地点错误：转换涉及一些其他的情景
4）人物错误：这种转换关涉到其他人
5）自我评价：我关于自己的感觉，对于我的反应有很强的影响，但是你并不能直接知道我的这种感受，无论是平时还是现在
 

II 帮助：十大经验法则
1）关涉到生存问题时，必须把人放在第一位，别无选择
2）如果不是高度技术化的工作，领导者就可以通过威慑来领导，而不需要太强的能力
3）有强大技术背景的人可以吧任何任务斗转化为技术任务，以此逃避他们不想做的事情
4）不关心人的领导没有可以领导的人，除非手下人别无选择
5）如果你不能提供什么实质性内容，却要假装有内容，那么无论你多么关心别人，都不会吸引住他们
6）面向任务的领导往往高估了自己的成就
7）我们所做的工作，几乎无一真正重要到必须牺牲执行者的未来
8）如果任务很复杂，就没有哪位领导能够担保计划不会'百密一疏'。（也就是说在复杂环境下，大多数任务优先的领导也必须把人放在首要位置，否则就不可能完成任务）
9）要成为成功的技术领导，就不能对任何人的人性有丝毫的抑制
10）如果你是领导，以平常心对待他人就是你的任务。在此之外，没有其他值得完成的任务。
 

子模型五：有效组织
1. 有效组织的三大障碍：
1）抓大目标：忙于做大事，没有时间来做那些组织本来应该做的事情
2）把人当机器：人非机器，可能按照你的表达方式去做而非按照表达意思去做
3）亲自动手：领导者的任务是创造环境，而非替他人完成任务（除非关系存亡）
4）奖励低效的组织：真正的组织是缺乏艺术和激情的，我们热衷奖励那些问题不断，但决策经验丰富的组织而非那种能够避免问题的组织（沉静型领导）

2. 学习成为组织者：
1） 观察 —试验 —寻找差异
2） 入门级观察者通常会混淆真正的组织结构和表面上的权利结构

3. 有效组织的形式：
1） 各自独立解决（Individually）
2） 投票（Voting）
3） 强势领导（Strong leader）
4） 一致意见（Consensus）

子模型六：个人成长
1. 螺旋式循环上升
1）经历高原：慢速增长
2）经历低谷
3）从低谷到新的高原：实现快速增长

2. 了解自我：写日志
1）我的情况如何
2）我每天做什么
3）我的感觉如何
4）我如何发现他人对我的反应
 
3. 描绘事业线，量化你的事业，在时间轴上标出你的人生曲线，可以得到以下结论：
1）重要的不是事情，而是你对事情的态度。
2）成功可能滋生失败
3）每个成功的技术领导都具有远见：拥有你才能贡献的特殊成分 ，是培养眼见的关键
4）缺乏远见的人对他人没有什么影响力
 
4. 正确看待力量
1）力量的来源：技术、关系、专业技能
1）从关系的角度看待力量
2）在遇到一个获得力量的机会，先问问自己到底要用这种力量干什么
3）在组织中，完成力量的转换
4）避免专业力量所带来的锤子效应
5）成熟强调的是交际和沟通的能力，技巧则是次要的


5. 你的支持系统：支持是互惠的
1）来自技术资源支持
2）来自批评的支持
3）对个人成长的支持
4）对个人健康的支持
5）对情绪的支持：你倾诉的对象
6）对精神的支持

6. 从元规则到指导准则
1）界定规则（我必须帮助所有人）
2）找到这条规则与自己无意识心理相协调的理由，每一步做出微小的改变，直到新规则形成
3）将命令转化为选择（我可以时刻帮助任何人）
4）从确定性到可能性（我可以在某些时刻帮助任何人）　　
5）从通用到非通用（我可以在某些时刻帮助某些人）
6）从普遍到特殊（我能在某个时刻帮助某些人，当…）

形成最终规则：我能在某个时候帮助某些人，他们明确要求我的帮助，我有能力帮助他们，我有资源帮助他们，帮助他们让我感觉很好，我选择帮助他们，我能承受帮助失败的结果



第一章 领导力究竟是什么？
    所谓领导力，就是创造这样一个环境，每个人都能在其中发挥更多的能力。

    领导力模型
    全面(organic)模型: 系统化思维 —— 某一事件必然是包括时间在内的千百种因素共同作用的结果；
1. 价值在于：能够从容面对自己并未充分理解的复杂形势。
2. 根据人的特殊性来定义人，容许各种各样的人找到复杂环境中共事的基础，在其它人身上发现同样的生活动力、
精神基础，及个人特质之间的类似联系。不以统一标准衡量所有人；让人实现内心的和谐。强调一对一的关系。
3. 对待变化的态度: 将变化看作有条不紊、按部就班的过程。更适合稳定的环境。安全感来自尽早阻止它。
4. 模型关键字: 种子、选择、发现

对事件:有系统性思考。 认为某事件是由数以万计的其他因素作用的结果，包括时间的流逝
定义个人:考虑人的惟一性，即共性加个性
对关系的定义：将关系定义为一个独特的个体和另一个独特的个体之间的联系
面对改变的态度:期待和接受改变，将改变视为守宙的普通一部分，甚至欢迎改变，将其视为进入未知和成长领域的机会

    线性(linear)模型: 结果必有原因，原因必有结果；
1. 价值在于：大量的事件可以找到单一原因。
2. 希望把人分门别类，高效与人打交道；能组织大规模行动。
3. 对待变化的态度: 某个时刻不可能仅仅改变一点。安全感来自承担风险和容忍不确定性。

对事件:假定事件之间是线性关系
定义个人:将个人分门别类
对关系的定义：按照角色而非个人来定义关系
面对改变的态度:将改变看成是有序的，一次仅改变一件事的过程。在相对稳定的环境中非常有效

    惩罚/奖励(thread/reward)模型：带有道德色彩的线性模型 —— 答案有且只有一个。
1. 人的行为完全由面对的威胁和奖励所决定；权利植根于角色，而不是关系，钟情于头衔。强调权威
2. 安全感来自竭力保持所有人和关系不变化，或把变化转嫁给其他人（"改掉""不良"行为）。
    模型关键字: 力量、决断

第二章 领导方式模型

领导人的MOI模型：
M：激励(motivation)——奖励或是磨难，用来激励或惩罚相关的人
O：组织(organization)——现实的组织结构，将想法化为实践
I：头脑或创新(ideas or innovation)——种子，对未来图景的想象

强调创新的技术领导的三个关注点：
理解问题（understanding the problem）
    1）细心阅读规范（成败往往取决于问题定义的细小差异）
    2）鼓励成员认真阅读规范（鼓励其他人这么做是通过激励来实战的领导力）
    3）解决分歧时，要回到最初的问题（许多冗长争论的对象并非方案的相关价值，而是对问题的不同理解）
    4）从客户处获得规范的清晰定义和额外信息（有时候，不经意的交流就可能带来巨大的回报）
    5）工作一段之后，能更好理解某些需求的意义时，回头看看规范（高效有力的领导通过持续的测试来检查自己对工作的理解。它们固然自信，但也清楚自己的思维局限。）

管理思维（managing the flow of ideas）
    1）为团队贡献一个明智的想法（同样的思想在世界上出现，不是一次，也不是两次，而是无数次。比明智的想法更重要的是创造一个环境，只要真正能解决问题的想法一冒出来，就能被识别）
    2）鼓励借鉴有用的想法（大多数'新'的想法其实源自其他场合的旧想法）
    3）完善团队中其他人提出的想法（任何想法在刚刚形成的时候都不是完美的，即使是直接拿来套用的想法，也要修改才能适应新的环境）
    4）在团队希望完善的想法面前，放弃自己的想法；如果一个想法不是每个人都懂得，就不要放弃
    5）顶住时间压力，在其他人解释他们的想法时要耐心听取（在能够听取各种想法的环境中，项目进展更快，哪怕这些想法看来并不适用，项目的进展都要快一些）
    6）尝试其他人提出的想法（如果一个想法看来不错，他们就准备迅速地抓住，加以改善）
    7）为了让想法不断涌现出来，不要太早否定同事的想法（否定是一回事，轻率的否定是另一回事）
    8）如果必须批评一个想法，五笔明确，批评的对象是想法而不是人（不是每个想法都适用于每个问题，但是每个人都是有用的。在做否定的时候要很小心，斟酌要说的话，只否定想法，不否定个人）
    9）在给出想法之前，要试一试（没人能聪明到一人拥有全部的好想法；滔滔不绝地讲述未经深思熟虑的想法，倒是会大大妨碍其他人的思维）
    10）如果时间和人力不够，就别费力去寻求新想法，维持现状就好（上帝只用了六天创造世界，之后就不再创造新的物种）
    11）如果之前成功的想法不能适应新的形势，要鼓励团队放弃它（香蕉冰激淋，一天吃三次也会吃腻的）
    12）如果先前放弃的想法对问题的某个部分有价值，要重新采纳（想法本身没有好坏，只有在不适合的时间，不适合的地点出现的想法，对时机的把握要非常好）

保证质量（mantaining quality）
    1）在项目进展中测量质量（如果你没有解决要解决的问题，其他问题都毫无意义）
    2）在设计方案时，要设计工具和程序来衡量质量（衡量真实进度和质量看似项目的负担，但是好的工具能创造出一个环境，让质量控制变得简单自然）
    3）衡量实施速度，比照计划，随时准备改变解决方案（很多高科技企业就是因为产品面世迟了几个月而惨遭淘汰）
    4）脱离项目来观察，更新自己的看法，评估项目的生存能力（必然要失败的项目结束的越早，节省的资金就越多）
    5）在实践想法之前，要与客户一起检验（真正的领导更喜欢成功，独来独往只是附加品。如果客户不付钱，项目就谈不上成功）
    6）如果想法是错的，要重振士气（失败就是摆脱错误想法的束缚，是一种解脱，由此开始新一轮的创造＼实施和检验，而且这次额的效率会更高）


第三章 解决问题的方式
理解问题，创造所有人都能明白问题的环境的几个常见做法：
    1）细心阅读规范
    2）鼓励成员认真阅读规范
    3）解决分歧时，要回到最初的问题
    4）从客户处获得规范的清晰定义和额外信息
    5）工作进行一段之后，能更好理解某些需求的意义时，回头看看规范

驾驭新想法的十二个典型办法：
    1）为团队贡献一个明智的想法(Aristotle:It is not once,nor twice,but times without number that the same idea makes its appearance in the world)
    2）鼓励借鉴有用的想法
    3）完善团队中其他人提出的想法
    4）在团队希望完善的想法面前，放弃自己的想法：如果一个想法不是每个人都懂得，就不要放弃
    5）顶住时间压力，在其他人解释他们的想法的时候要耐心听取
    6）尝试其他人提出的想法
    7）为了让想法不断涌现出来，不要太早否定同事的想法
    8）如果批评一个想法，无比明确，批评的对象是想法而不是人
    9）在给出想法之前，要试一试
    10）如果时间和人力不够，就别费力去寻求新想法，维持现状就好
    11）如果之前成功的想法不能适应新的形势，要鼓励团队放弃它
    12）如果之前放弃的想法对问题的某个部分由价值，要重新采纳

通过以下办法来控制环境，保证质量：
    1）在项目进展中测量质量
    2）在设计方案时，要设计工具和程序来衡量质量
    3）衡量实施速度，比照计划，随时准备改变解决方案
    4）脱离项目来观察，更新自己的看法，评估项目的生存能力
    5）在实践想法之前，要与客户一起检验
    6）如果想法是错的，要重振士气


第四章 领导的成长
    领导成长模型：
    这个模型中存在两个主要阶段：慢速增长阶段(高原阶段:plateaus)和快速增长阶段(低谷阶段:ravines)，
他们轮流出现，不分先后。练习是慢速增长的一部分，同时在一些少数突破里产生了重大进展，同时在努力进步
的时候，必须要稍稍退下来一些，跌入低谷，才能取得重大进步。而真实的成长里面有大量的随机因素，个人
很容易被这些噪声所覆盖，所以这里对个人的要求也很高。

元学习(metalearning): 学习如何学习


第五章 我做不到，因为...
    常见的，逃避成为技术领导的痛苦的理由：
    1）'我不是主管'，认为只有在位的领导(Leader)才能管事，造成这个观念的原因是使用了传统的惩罚/奖励模型，
这个模型下领导力和管理是等同的。而在全面模型里面，任何团队都是个系统，割裂开是无法从整体上理解的。从而
大部分人认为被任命的领导就是团队中最重要的元素；另一方面人们很容易混淆'最薄弱'和'最关键'的环节，从而
信任被任命领导。
    在涉及良好的工作团队里，领导力来自任何人，而不是被任命的领导。因此你不需要等待——你也不应该去等待——
任命。
    2）'我不是领导那类人'，任何人都能掌握激励、组织和创新。尤其是创新是每个人都能够做到的事情，掌握
一点依靠创新来领导的技巧，也能增强激励型领导力和组织型领导力。，成为解决问题的领导，无论他是否觉得
自己是当领导的那类人。
    3）'我的技术会退步'，降低一些创新技能，换取一些激励和组织能力。这种这种无可避免，或许也是他们必须
做的最艰难的选择。
    4）'成长的压力很大'，不要给自己压力，知道环境所迫才改变的方法并不坏，没有什么方式比它更高明，除非
你设定了某些必须努力完成的目标。当领导，不一定要有个头衔。
    5）'我不用那么强大'技术之路永无止境，这种方法只是很基础的方法，在日常问题，例如生活、自由以及对
幸福追求上应用这种更平凡的领导方式，能够收获更多的能力。


第六章 创新的三大障碍
    1）看不到自己，看不到自己的行为，所以没有机会改变，不能从旁观者的角度去认识自己。
    2）没问题综合症，欺骗自己，以为早就知道所有问题的答案
    3）相信经院心理学的中心教条，看不见其他办法，即使你不需要他人帮助就能找到这些办法


第七章 加深自我了解的工具
    把写日记作为技术领导之路的第一步，做更多的帮助和激励，使得记录更真实，保护好他，控制哪些人能读分享
自己的日记，这样才能完全忠实于自己的感觉，才能不带偏见的了解自己。
    写日记不像书本或者演讲那样有距离感，日记里的没一点都与你有关，你能够学到自己最需要知道的，关于自己的
知识。每个写日记的人，都学到了他们最需要知道的、关于自己的知识。
    没有人知道你需要学什么，和可能你自己也不知道。但这不是逃避写日记的理由。实际上，这恰恰是写日记的理由。


第八章　提升创新能力
    缺乏自我认识，意味着我们从不会注意到自己的错误，所以我们不能发现错误，把坏事变成好事，强调自己
不犯错，就会看不到自己，借此自我保护。
    迷信自己的智力，意味着我们永远不会想过要借鉴别人的想法，所以我们不能从偷窃创意中受益，强调
 个人主义和竞争，合作就变成了'欺骗'，就会让个人相信自己应当做最聪明的人。
    相信每个问题有且仅有一个答案，就会认为把想法合并起来很愚蠢，所以当然不用考虑综合，只能专注于考试，
专注于每件事情有且仅有一个正确答案。


第九章 眼光
    大多数人的事业线都有高点和低点。对此很多人都很意外，因为我们的文化很少谈论这些，至少男人不谈这些。
可是你一旦谈起，会有许多意想不到的感觉。生活中同样的时间，有的人在那里是顶峰，而有的人则是低谷。低谷
所带来的沮丧，其实是一个更新更高的事业阶段的开始。
    失败又很多原因，可能是外部困境，也可能是我们自己的缺点。有时候根本就没出什么错，只是因为我们登的
太高，而之前的成功已经改变了造就它的环境。
    许多人以为成功的人不会经历低潮，但生活对任何人来说都不是童话。美德不一定带来回报，智慧有时铸成大错，
不会有人次次都成功。成为领导者并不是因为从没有失败过。有人能成为领导，是因为他们能够面对失败。
    研究个人的事业线所带来的重要经验：
    重要的不是事情，而是你对事情的态度。
    每个人都会经历失败，而这种失败可能正是成功带来的。
    每个成功的技术领导都具有个人眼光。
    缺乏眼光的人对其他人没什么影响。


第十章 激励他人的第一大障碍：不能像其他人那样看待自己
    如果你不能接受有时你会成为笑料这个事实，在一言一行都会被细细揣摩的时候，你就没法获得成功。
    
    每一种交流都会得到下面的某种结果：
    1）开创新的可能
    2）强化旧的可能
    3）激活生存规则
    4）增强攻击性
    5）加重痛苦
    
    Satir的交流模型：在'你表达'和'我回应'之间，我的内心发生了以下七个活动（Step by Step）
    1）感官接受（sensory input）
    这种接受不是完美的，其中包含很多的'漏洞'。我们每次接受都会丢失一些信息，人永远不能毫无错漏地接收
到发来的信息。所以你可以用两种解决办法：努力看的更清楚，听得更清楚；也可以提醒自己，有些人的反应可能
不会跟你的期望相符合
    2）解释（interpretation）
    我对你的回答进行解释，但是这里也存在两个问题：一方面，多种解释是可能的；另一方面，即使你想到了若干
种解释，也可能不包括说话人的意思
    3）感受（feeling）
    你可以选择自己是否要了解俄这种感受，是否要把它与其他感受区分开来。如果你清楚自己是否生气、受伤、激动
或是害怕，如果你明白其他人也有这些感受，甚至对你说话也会有这样的反应，整个事情就更容易理解了
    4）对感受的感受（feeling about the feeling）
    最关键的一点：关于感受的感受，取决于我对自己的感受，这种感受是自我良好、从容泰然，还是脆弱且容易受伤？
这时候每个人就是与自己的生存法则想关联，类似于'我一定要强大''我不能表现出畏惧'等等。人往往根据以前的经验
来对你做出反应，这样能够以后更轻松的与之相处
    5）防卫（defense）
    你可能很难相信，在你面前每个人都需要自我防卫，但是如果你希望明白自己为什么激励不了别人，最好还是相信
这一点
    6）发表意见的规则（rules for commenting）
    结合自己的内心反应，根据自己的谈话规则选择自己该说什么话
    7）输出（outcome）
    你可能并无法准确地把握自己的视觉和听觉，但你肯定可以控制自己的行为
    
    导致交流发生问题的5个主要原因：
    1）接受差异：双方没有以同样的方式接受表层交流，因为人不同，接受也不同
    2）时间错误：转换涉及过去或未来发生的事情，这些事情与正在进行的交流没有逻辑关系
    3）地点错误：转换涉及一些其他的情景
    4）人物错误：这种转换关涉到其他人
    5）自我评价：我关于自己的感觉，对于我的反应有很强的影响，但是你并不能直接知道我的这种感受，无论是平时还是现在
    
    他人的许多问题源自与我们的交流，他们尝试找到我们疯狂举止的原因。但是，除非我们坦白说出来，否则他们没法
知道我的内心活动过程，所以直接说出自己的想法，对他们来说是很有帮助的。你可以首先告诉他们拟接收到了什么，
以及你对这种接受的感觉，可能的话，还要说出你对这种感觉的感觉。这样说出自己的心里话就可以开启了一个渠道，
它可能带给你你想知道的，关于自己的信息。

第十一章 激励他人的第二大障碍：人/任务两分法的信念
    个人的成功只与你有关，所以你必然能够平衡任务和自己的需求，尽管你可能没意识到这一点。于是你与其他人共事就
会遇到严重的冲突，而且这种冲突可能很难解决。
    
    实际上，在解决人和任务之间冲突的最好方式是确定你的目标：在结束的时候，他们对主题的关心程度是不是下降了？
如果是的话，那就是没做好，否则就是成功了。
    以下是一些经验:
    1）关涉到生存问题时，必须把人放在第一位，别无选择
    2）如果不是高度技术化的工作，领导者就可以通过威慑来领导，而不需要太强的能力
    3）有强大技术背景的人可以吧任何任务斗转化为技术任务，以此逃避他们不想做的事情
    4）不关心人的领导没有可以领导的人，除非手下人别无选择
    5）如果你不能提供什么实质性内容，却要假装有内容，那么无论你多么关心别人，都不会吸引住他们
    6）面向任务的领导往往高估了自己的成就
    7）我们所做的工作，几乎无一真正重要到必须牺牲执行者的未来
    8）如果任务很复杂，就没有哪位领导能够担保计划不会'百密一疏'。（也就是说在复杂环境下，大多数任务优先的领导也必须把人放在首要位置，否则就不可能完成任务）
    9）要成为成功的技术领导，就不能对任何人的人性有丝毫的抑制
    10）如果你是领导，以平常心对待他人就是你的任务。在此之外，没有其他值得完成的任务。
    
    我们不为抽象的利润而工作；我们为某些特定的人创造利润。我们的工作并不是为了保卫和平，而是为了让人们能够
享受和平生活带来的好处。
    任务/人的两分法的信念是做好激励者的第二大障碍，因为它假设，任务和人一样真实，而不是由人来完成的。根据
这个错误的二分法，你没准偶然能激励起他人，但是最终他们会看透的，而你可能还没察觉。一旦他们知道你是在愚弄他们，
你就不再是激励者了。


第十二章 帮助其他人会发生的问题
    人不可能去做他希望为别人做的每件事
    如果假装工作可以从人身上抽象出来，我们就能把交流合作的失败掩饰为机械性失败（例如，说'程序不能按时交付'就
 比说'我没有那么好的技术来帮Jack成为一个更好的程序员'要容易）
    
    现实中经常发生这样的问题：开始是真诚希望提供帮助，经过一系列混乱的沟通，最后变成情绪化的谩骂，结果事情变得更糟
    
    以下是一些经验：
    1）希望帮助他人可能是高尚的动机，但这不会降低帮助的难度（好心办坏事）
    2）如果对方不希望接受你的帮助，无论你多么聪明、多么出色，都不能成功地帮助他们
    3）有效帮助的开始，只能是双方都同意的对问题的清晰定义
    4）一定要多加检查，确认对方是否需要你的帮助（最简单的：问对方是否需要帮助）
    5）即使人们承认他们需要你的帮助，这种承认也是会变的（当你发现自己的帮助需要付出什么样的代价的时候，你可能不再想提供帮助了）
    6）希望帮助其他人的人，通常都希望有所回报，虽然他们可能并没有觉察到这一点（提供帮助后，对方如果连一句谢谢都没有，很少人能心里很爽吧...）
    7）大多数人都知道，提供帮助的人也是自私的，却又认为自己是例外
    8）提供帮助的好意，却往往被视为干涉的企图
    9）无论看起来多奇怪，大多数人其实是希望帮助他人的
    
    帮助你身边的人，必须是在这样的情况下：如果你是对方，也希望获得帮助；而且是按照你希望被帮助的方式来做。
所以如果你希望激励其他人，无论是直接的激励，还是通过创造能给人帮助的环境，都必须首先让他们相信你关心他们，
而唯一让他们信服的办法就是真正的关心。人们可能会在关心的问题上受骗，但是不会一直受骗。
    爱他人——也就是帮助和领导他人的能力，建立在爱自己的能力之上。
    如果你的自尊心不够强，你激励他人的没一点努力都会遇到阻力。所以在你帮助其他人以前，最好是在自己身上多花点
功夫。（自尊心越强的人往往压力越大，待人有礼貌，做事情考虑后果，这样会被更多人所赞赏。 能够积极履行个人对
社会和他人应尽的义务，为人处世光明磊落，对工作有强烈责任心；在学习方面，能够发扬自觉、勤奋、刻苦的精神。 ）


第十三章 学会激励他人
    如果你想要学习激励其他人，最好的办法就是转变你的生存规则，别再认为自己没价值，没能力，好像一条被鞭子抽过
的狗。自己的'我没什么大用，无所作为'转变成更有意义的指导规则'我确实和其他任何人一样有价值'
    每个人都有一套跟人打交道的规则，这些'生存法则'中的一部分是我们成人之后明确学到的，有些甚至是我们记不清楚
是否有意识的时候就学到了。这些规则来自一个时期，那时候我们要生存就必须依靠恰当的交流，所以它们总伴随着强烈的
情绪。因为那个时候，我们还不清楚世界时怎样运行的，我们往往认为它们不是'学到'的规则，而是通行的真理。
    
    将自己的生存规则（ruls以及元规则）转化为指导规则（guides）的步骤：
    1）明确清晰地表达规则（我必须时刻帮助任何人）
    2）明确这条规则的生存价值，与自己的无意识心理相协调。
    在规则转变的过程中，重要的是每一步都要尽可能安全；如果结果对你不利，你的无意识就会抵制。在转变的每一部，
无意识可能在不回方方面面跟你沟通，但是你的身体的感觉会告诉你，是否该继续下一步
    3）给自己一个选择（我可以任何时候帮助任何人（如果我愿意的话））
    可以把规则的形式从命令变为选择
    4）从确定性到可能性（我可以在某些时候帮助任何人（如果我愿意的话））
    每个人心中有这样的原则：我必须随时随地照这条规则做（极致规则），应当处理这样的规则，让自己能够改变自己的规则
    5）从通用到非通用（我可以在某些时候帮助某些人（如果我愿意的话））
    6）从普通到通用
    改变的意义在于让你明白，你自己有选择，所以要警惕你的其他规则
    最终规则转化为：
    我能在某个时候帮助某些人，他们明确要求我的帮助，我有能力帮助他们，我有资源帮助他们，帮助他们让我感觉很好，
我选择帮助他们，我能承受帮助失败的结果


第十四章 力量从何处来
    有了自尊，影响他人就不是问题
    力量不是所有物，而是一种关系。当你依赖于某个人或者某个机构，依赖程度越高，它的力量就越大
    维克多雨果：一旦属于某种思想的时代来临，这种思想就是世间最强大的力量
    从专业技能获得的任何力量，都构筑在你和其他某些人之间的关系之上。如果你是登山队的领导，那么你的编程技能不会
带来任何权力。这时，你要是努力向其他人证明自己的技术没有退步，那只能是更加证明了你自己不是一个称职的领导。
    关于力量的想法，总是有让人迷惑的一方面。因为人们不习惯从关系的角度来看待力量。
    维持力量的第一步就是，别处心积虑地想要留住它。它直接来自'关系即力量'这个人是。对力量的期望不是对某样东西
的期望，而是对关系的期望。如果你不知道自己要什么，力量对于自己来说，迟早会失去。所以一定要忘掉为了获得更大的
权力而去升职这样一个愚蠢的想法，摆脱力量的诱惑，更清楚地了解自己。
    如果你遇到一个获得力量的机会，先问问自己到底要用这种力量干什么。如果你不知道这一点，在以前的力量开始消失，
新力量还没出现的时候，你肯定会犹豫，迷失方向。所以当你自己知道需要什么的时候，力量也就随之即来了，而且必定是
你想要的力量。


第十五章 力量、缺陷与一致

    所谓成熟的人，就是在成年之后，能根据对自身、其他人及自己所处环境的准确认知，做出选择和决定的人；他承认
这些选择和决策是自己的，并对后果负责。
    许多问题会出现，其实是因为缺乏自尊心（low self-esteem），但是，这些问题与缺乏自尊心之间的关系可没有那么
容易发现。许多问题是机械性问题，看起来与自尊心毫无关系。（这里说的机械性问题是指，它可能看起来很深刻很复杂，
其实解决起来只需要一些技术手段，一点巧劲，而不需要太多的情绪或心理的折磨）。所以机械性问题的最好揭发更多
依靠物理学而不是心理学。此类问题不是由事件——机械的部分——而是由时间的反应引起的。
    
    成熟是对行为的大量统计的描述，这些行为我们可以一点一滴地改进，这样的人能以一种相对有理且准确的方式面对
世界，具有以下特点：
    1）与其他人打交道时思维清晰
    2）清楚自己的想法和感受
    3）能够看到、听到自己以外的世界
    4）交往的时候，能把他人视为与自己不同的独特个体
    5）把差异作为学习和探索的机会来看待，而不是当作威胁或冲突的信号
    6）能够设身处地地与他人交往，能认清事实，而不是照自认为'应该'的样子，或期望的样子来看待世界
    7）对自己的所感、所想、所问、所见负责任，而不是否定这些，或是归咎于其他人
    8）交流时能坦率地表达、接受并核实各种意图
    
    这种成熟的描述强调了交际和沟通的能力，相比之下技巧没有那么重要。如果你掌握了这些交际和沟通的能力，你就能
很快想出或是模仿所有需要的技巧。
    创造解决问题的环境的第一步是让自己成熟起来，但是不能依靠取巧。如果你对自己的个人价值没有认识，也没有更广泛
的交际和沟通能力，香水是掩盖不了你的缺点的。如果你确实有这些认识和能力，就能及时找到你所需要的有关知识。
    在内心高兴的时候记得微笑
    很多人弄混了自然行为和在生命早期学到的行为，而且没有认识到这一点。实际上，你学到的行为都不是自然的，因为
自然就是保持一致，就是展现你内心的真实感受。
    在与其他人相处时，我必须尽可能保持心口一致，要实现它，我必须改变原来的规则，改变我在生命早期养成的习惯，
让它们更加符合我现在的情况，以及明天我想要成为的样子
    你或许必须在所有时候都做到完美，但肯定不必在所有时候都做到坚强有力


第十六章 培养组织力
    帮助他人的许多能力来自个人力量，但如果认为只需要个人力量就足够了，实在太天真，成为领导，就要求具有组织力，
这样才能从为其他创新者争取到资源。
    技术力量正在消退的新领导需要新的力量。因为技术的力量不会一下子消失，所以，如果新的领导懂得力量转换，就
还有机会来积累其他优势。
    不是什么事情都很危险（不去陪领导，不去和同事玩），你必须清楚自己拥有什么力量，想得到什么，利用自己的力量
换取更强的力量，不喜要别人多嘴。而那些运用他们职位的权利去开无聊的会议，搞八卦内部斗争的人。虽然也在强化他们
在这个环境中的地位。但是他们在浪费自己的职位力量，浪费在一些没有价值的东西上。
    工作经验只是一种幻觉，有权的人靠这个指使手下人干蠢事。
    从为自己提供力量到为他人提供力量都是非常重要的事情，需要话很长的时间学习，但是这是
作为领导，最迫切需要的知识。
　　领导的职责是创造这样一个环境，每个人都能在其中发挥出更多的能力。只有做到这一点它们才能把自己的力量训练和
引导到更高层次的目标。


第十七章 解决问题团队的有效组织形式

    团队解决问题的四种组织方式：各自独立解决（Individually）、投票（Voting）、强势领导（Strong leader）和一致意见（Consensus）。
通常会采用的形式总是这四种形式的结合体。

    Individually
    各自独立解决是后面三种方式的基础，如果集体组织起来不能不单干更好，最好的组织方式当然就是各自为战。
    
    Voting
    投票这种方式适用于有明确时间限制的情况下，而且前提是大家能理解且认可投票的方式。如果我们为了确保避免做出
太差的选择，投票也是可取的方式。投票决策能够保证结果等于或高于一般水平。
    在以下几条中至少一条成立的情况下，投票是比强势领导更好的办法：
    1）从人事方面考虑，任命一个人当领导并不是好办法
    2）我们不能预先知道，谁是最见多识广的人
    3）我们可能不知道，谁会是最得力的领导
    4）我们疑心、担忧临时的帮派可能会破坏公开讨论
    5）没有人愿意承担个人责任
    6）给每个人参与感非常重要
    投票是个稳定的办法。如果没法形成一致意见，投票的结果要更好些。如果领导见识很少，或是领导虽然知道一些信息，
但不能或不愿了解团队中其他人的信息，它就比强势领导更好。另一方面，如果团队成员的水平彼此相当，那么投票比不上
任何一种其他策略。
    投票的另一个弱点在于，人员间没有信息流动。投票结束后，大家仍然知之甚少。如果要让参与者从决策过程中获得
教育，投票就不是合适的决策方式。
    
    Strong leader
    强势领导的方式下，决策的质量取决于领导的风格与知识。不管是他排斥不同建议，还是接受团队中的其他人的信息，最终的结果都是取决于领导个人的能力。
    
    Consensus
    一致意见的方式下，需要消耗大量的时间和人力。但是它确实是最有吸引力的办法，因为它通常都能得到高质量的决策。
如果想做到这一点，参与者必须遵循下面的原则：
    1）记住，不是每一项决策的每一个细节，都必须获得每个人的完全认可，但是团队中的每个成员都必须对每项决策保持原则上的同意
    2）不要仅仅为'你自己的'意见来争辩，而要使用逻辑和事实支持你的每一个决定
    3）不要为了和气改变自己的意见，鼓励其他人给你事实和逻辑，来说服自己改变主意
    4）鼓励其他人在改变意见之前，先想想事实和逻辑
    5）拒绝使用单纯为了避免冲突的办法，例如少数服从多数，平均主义或是互相捧场的做法。如果是事实，无论看起来多么没有意义，都要坚持使用
    6）告诉自己，不同意见是有价值，只要它们有事实和逻辑支撑
    7）不要为保持自己的形象而隐藏信息
    8）必要的话，运用你的直觉，但是务必要清楚你在运用直觉。在争辩中，直觉是有效的
    
    一致意见决策的一大优点在与它能共享信息，在相互了解的过程中，决策的速度就会变得飞快。产生这种改进的一个
原因是，一致意见决策的团队能够分担工作的责任，鼓励每个人做负责。
    一致意见决策最需要的是成员具有一定的专业知识，否则可以发现大家在提供信息的时候会很不自信，这时候就需要
在一致意见决策之前独立工作，认识问题。也可以组织一支更加专业化的团队。
    一致意见并不是'不要领导'。它只是说，任何领导行为都必须受到一致意见决策原则的限制，它关注的不是讨论的
内容，而是取得一致意见的过程。另一方面，只要遵守了一致意见决策的那些原则，整个讨论甚至可以没有明确的领导。
    
    Form follow function
    很少团队会纯粹使用上面四种的某一种决策形式，团队通常使用一种或多种其他的决策形式来辅助某种形式的摸个方面，
弥补它的弱点。即使仅仅运用单一的组织方式，也可以有许多变化（比如投票加权）
    
    这些组织决策方式，要真正生效，受影响的人必须赞同使用这种组织决策方式。最重要的是这种赞同必须成为一致意见。
如果团队要尝试一种新的组织决策形式，就有人来挑战这种潜在的一致意见。这并不是引发议论那么简单的事情，所以没有
人会轻易改变，除非他确信新的组织形式会更好。
    
    对以一个团队来说，在做出决策时，没有什么组织方式永远是最好的。应该以'功能决定形式'的准则选择决策方式。
解决问题的组织，它的功能就是创造一个合适的环境，让大家：理解问题、管理思维、保证质量。如果当前的组织
形式无助于这三个目标，决绝问题的领导就必须开始寻找新的方式。
    要知道的不是最好的方法，而是当前情况下最好的方法。情况变了，团队也要跟着改变。没有哪种组织方式永远是
最好的，也没有哪种组织方式能够在长时间内保持最好。最高效有力的领导人是这样的人：他们能够帮助团队人士环境
的改变，并找到合适的组织决策方式。


第十八章 有效组织的障碍
　　第一重障碍：抓大目标（Playing the big game）
　　'抓大目标'的规则只有一条：'做你能做成的任何事情。'所以有些人要尝试给其他人负罪感，或是粉碎其他人的自尊心。
其他人则排挤有权势者，希望削减他们'下命令的权力'。人们忙于大事，没有时间来做那些组织本来应该做的事情。

　　第二重障碍：把人当机器来摆布（Organizing people as if they were machines）
　　对待人就像是程序员对待机器那样对待人，而不把人看做有头脑的决策制定者，能够以多种方式理解一个命令。
而过去的磨难肯定已经告诉你，问题通常不在机器那里，更可能是因为你的命令不正确。你想表达的意思与你表达的
方式不一致，机器却只会老老实实地照你的表达方式执行。
    与机器不同，人类能够以许多方式理解对方的命令，抓大目标的人，如果其他人能够理解和执行他们的命令，会觉得这
种好运气是理所当然的。另一方面，如果被误解，他们只关注挫折感，认为其他人尝试妨碍他们做大事。这种方法的问题在
于，参与者对于挫折的反应可能会像对机器那样——尝试让他们的命令更加稳定，更加精确。尽管这办法可能有时候有效，
但是做的很过分，作为组织基础的那些关于标准和流程的文案就会过度繁冗。没人会花时间来看，更不要说照着做了。
忙于借助议程和备忘录来组织的领导，很快脱离了那些本应执行他们指令的人。

　　第三重障碍：亲自动手（Doing the work yourself）
　　解决问题的领导的职责，通常不是解决单个问题，而是创造一个环境，许多问题都可以在其中解决，现在是这样，
未来也是这样。如果领导最直接最强烈的反应就是亲自动手，替其他人完成任务，而实际上，人不能像计算机或者混凝土
搅拌机那样去执行任务。人的确会执行命令，但是影响他们的还有建议、表扬、暗示、想法、鼓励、推荐，一级对工作进展
的反馈。组织其他人工作，必须有不同的方法来作出决策，发出命令（他们之所以不愿意提供建议，是因为他们不希望
这些命令被误解为"抓大事"的命令），否则自己动手就成了组织其他人解决问题的最大障碍，而且这样的障碍不是很向
缺乏有效的沟通方法那样容易解决的，后者可以依靠训练和经验来克服。（当然了，现在的问题不解决，也谈不上未来。
所以在问题的界定上十分重要，这也是领导面对的最困难的问题。）

　　第四重障碍：奖励低效的组织（Rewarding ineffective organizing）
　　最好的领导，极少会面临必须做选择的局面，更不要说事关生死的选择了。
　　和平更难维护，战争更具英雄色彩。真正优秀的组织是缺乏艺术激情的。
　　组织不是要解决问题，而是要避免问题。如果你挣扎于问题之中，进行真正有效的组织就太迟了。。

　　全面的组织（Organic organizing）
　　解决问题的领导的全部目标就是：创造一个环境，其中每个人都能解决问题，做出决策，执行这些决策，他不需要亲自
解决问题，做出决策，再执行。
　　在这种模型中，组织不是创造一系列僵硬的规则，也不是下命令/执行命令，组织过程就是完成任务的过程。几乎任何人
都喜欢有些时间自我安排，有些时候接受安排。下命令/执行命令只是实现目的的手段，它本身不是目的。在大多数有效的
组织中，每个人都在解决问题，又在为完成任务做出决策。这种模型下，组织不是由担任领导的那个人完成的。


第十九章 学习成为组织者
　　对力量最高奖励就是：增强系统在其所处环境中生存和发展的能力。若我们能够做到这一点，就知道自己是有力量的。否则，其他一切力量的诱惑——控制、通知、特权、胁迫、报复、毫不退让、以不可或缺的地位作要挟——都没有意义，那些都只是末等奖励，其实它们是缺乏力量的表现。系统力量的真正底线在于：你能否影响整个系统？你能否能帮助系统更妥善有效地面对它所处的环境？如果你不能成为系统的进步和发展做出贡献，就只能的末等奖励。

　　实践
　　成为有力的组织者需要实践，而且要反复实践。可能他们害怕影响其他人的生活，所以想要首先学习理论。理论是重要的，但它无法杜绝所有错误。组织人的理论可能互相矛盾，如果没有实践经验作为指导，你甚至都无法理解它们。除非你已经有了足够多的实践经验来胜任这个有权影响组织结构的职位，否则，要从哪里获得实践经验？只凭想象力的话，你会遇到千百万种在不同的组织形式下与人共事的情况。

　　观察与试验
　　实践是最古老的学习方法，即使不去刻意寻找组织的经历，你也会发现，每天都身处许多不同的组织中。如果它看起来太过熟悉，没什么好学的，那么你需要培养更现代的学习技巧：科学的方法。
　　科学的方法是种很好的办法，它告诉你不要满足于被动地经历组织：科学意味着观察和试验，也就是说，每个尝试在日常工作环境中做这种简单观察的人，确实会在了解人们不同行为的自我组织方式上有所收获。
　　观察可以形成习惯。一旦你尝试在工作中这么做，你就可以在任何地方实践，积累更新鲜更丰富的经验。
　　试验就好像观察，能形成习惯。如果你掌握了一些观察的技巧，就可以尝试些试验（不需要向任何人请示汇报的试验）。

　　寻找差异：他们在尽力做到最好
　　当发现团队的组织方式后，寻找真实情况和表面情况之间的差异（入门级观察者通常会混淆真正的组织结构和表面上的权力结构）
　　团队也会像个人一样，由于面对当前问题选择了错误的组织方式而遇到功能性问题。通常，理解一个功能失常的团队的时候，我都假设这个组织的存在是为了解决某些问题，但它可能不是当前要解决的问题。通常这个问题可能是团队曾经解决过的问题。而新团队组织通常是错误造成的结果。

　　他们都在当前情况下尽力做到最好。如果我觉得他们没有尽力做到最好，我就没有理解他们的处境。

　　许多问题之所以会发生，原因在于人是不同的，但是在设计组织形式时，并没有考虑到这些差异。人在社会、信息、决策和行为方面有不同的偏好。所以解决组织方式的很重要一点就是认识到对方的存在，然后找出一种能够正当容纳每种需求的组织形式。

　　把自己当作团队的模型（Use yourself as a model of the team）
　　你的思维深处是深入理解组织最好的地方。现代的脑研究告诉我们，大脑不是单独的整体，它更像是一群互相交联的脑，其中每个都有自己的才能、偏好和弱点。你越清楚自己大脑的工作原理，就能越好地利用这种模型，理解团队中的事情。
　　人与人的区别就在于他们如何充实自己——依靠外部资源还是内部资源。

　　你是否体会过这样的矛盾，想独处，也想与其他人一起？如果是，你或许就能更清楚地认识人与人的分歧：有人需要自己解决问题，其他人希望解决问题的回忆开得更久一些。

　　成功后仍要改变（Chang as you succeed）
　　要成为高效有力的领导，可以从各种各样的途径获得知识。而发现那些最适合自己的方法之一就是，借鉴大脑的群体模型，并整理团队曾用过的解决问题的想法。不要为了任务而组织你的大脑，要问自己，你的大脑的组织最适合解决哪种任务。然后选择一个最合适你的才能和偏好的办法。对组织方式的学习，能够提供给你巨大的能量来做出改变，改变会造成差别。有一天你可能会发现，自己不再是以前那样赢弱了。


第二十章 领导要面对的考核
　　当你变成领导的第一天起，你就要面对一整套新的游戏规则，但是你没有规则手册可以查，以前你只需要对自己负责，而现在你需要对许多人负责。

　　在领导岗位上，别人对你的评价不是加法，而是乘法，所以你的任何弱项都会拖你的后腿。如果你想向潜在的领导方向努力，其他人的反应肯定就是这样，给领导挑错是普通人的一大消遣。别忘了，领导可供批评的地方是常人的两倍——无论是内容，还是形式。

　　没有人说生活必须公平，尤其是在你希望获得更多的金钱，更多的特权或者更大的影响力的时候。

　　改进的方法其实很简单，在乘法系统里面，如果你希望让你的分数最大化的升值，那就下精力把自己最弱的地方加强。

　　缺乏自尊是学习的一大障碍。

　　乘法评分只是常人的最基本的想法，实际上当他们对你的新上任，甚至会采取更加苛刻的做法：只看你的最弱的地方，无限放大它。

　　有时候你的弱点不是一个特定的方法或者问题，而是你面对它的感觉。

　　不需要回答遇到的每个问题。

　　对问题的焦虑只能产生更多的焦虑。

　　领导首先要建立的是一个舒适的环境，给双方一个增进相互信任的机会，尤其也要信任你自己。


第二十一章 通过自己的领导力考验
　　要想当好解决问题的领导，必须经历更严格的考验。

　　对高层管理者的考验
　　变成真正解决问题的领导。高层人物制定规则，也是在破坏旧规则。胆怯的服从者不会升到高层，也不会盲目违背规则。要成为领导，就必须有勇气打开密封的盒子，而且要能坚持在公司干上五十年。

　　经受考验的能力
　　领导力的素质之一就是经受考验的能力，一旦你登上显赫的地位，就要时刻接受考验。即使这种考验不是来自敌对的人，也不是来自和你共进晚餐的人，也会来自你的手下人。此外，还有不间断的自我考验。如果你做的不错，不久那些人就会在表面上停止考验。

　　如何应付搅局者、正确的方式
　　领导的两种主要的处理方式，取决于他们强调的到底是激励（人际策略）还是组织（计划策略）。当然还有别的策略，不过，重要的是要知道你的主要力量所在，因为这样你就不用依赖其他人的策略来应对局势。
　　逃避自己的弱点永远都不是一个好办法，因为这里有一个悖论：要逃避自己的弱点，你首先必须克服它。
　　总的来看，技术人员更擅长计划的方面，而不擅长人际的方面；而管理人员正好与此相反。所以如果想成为卓越的高层领导，要做的不只是把技术或者人际做好，两者的精通和结合，需要下一番力气

　　运用与滥用考验
　　如果你想称为领导，你需要很多的考验来衡量自己的发展。考验能够提供一条发展基线，让你知道自己要做什么。你的行为方式可能因此改变，但这必须经过长期而困难的实践。进行这种时间的唯一途径就是，投入到能够直面你当前弱点的环境。如果你不喜欢这种考验，也许你能有一个大概会干的不错的环境，而不是可能会让你登峰造极的环境。在这样的环境下，你只有很少的机会——也可能没有机会——来克服自己的弱点。
　　逃避真正暴漏自己软垫的考验，这样你能够过的不错，但永远不会登上另一个高原。如果你从未遇见无理的搅局者，也没有经历过其他未能完美解决的问题，你不可能因此而说自己拥有全面发展的成熟人格，这智能说明，有人在保护你自己，组织你成长，而这个人很可能就是你自己。
　　所以，千万不要希望自己能通过自己的领导力考验，永远也不会。


第二十二章 个人转变计划
　　如果你把大规模的学习拆分开来，同时注重学习策略的效率，理清你对于学习的心理反应，这样你就可能同时负担问题解决者和领导者的双重身份。

　　我们大脑的某个区域在排斥新行为模式，在这个充满未知的世界上，新事物通常是危险的，所以我们尝试新东西时，大脑会这样自我保护：
　　1）让我们处于一种特殊的警觉状态，这样就会更加关注身边的一切，而不仅仅是新的动向
　　2）放松注意力时，把我们拽回到旧的、安全的模式中
　　对于个人成长，尝试新的东西越多，就越容易积极面对新事物，自己应对不熟悉感觉的能力能够得到加强

　　了解改变本质的人懂得，照一条路走下去，经历一系列普通的、微小的改变，最终才能接触到宏大非凡的事物。只有能够认识自己，而且知道自己对变化的反应，才会有勇气雁阵悬崖峭壁而上。

　　你身边有成千上万的学习机会，但是如果没有计划，只能错失其中的大部分机会。请寻找灵感，再多找一些办法，来开始你的计划。如果灵感枯竭了，就从其他人那里寻找。

　　无论你灵机一动想到什么，也无论你从其他人那里获得什么建议，个人转变计划都源于对自己的认识。其他人谁也代替不了你。所以你的个人转变的计划第一步就是：对你自己的教育负责。


第二十三章 时间从哪里来
　　You don not find time,you make time
　　时间不是找来的，而是挤出来的。
　　如果你真正想做某件事情，总会挤出时间来做的。所以，如果你觉得没时间，可能就是你并不想做，可能你应该找个办法来放弃。

　　专注于目标：
　　1）不要重复你已经布置下去的任务（你必须让他们犯错误，这是你必须付出的代价，从长期来看，这样的效率更高）
　　2）不要争论技术细节来证明你的技术优势（争论技术细节只能说明你在事业上放不开，而你在事业不断发展的时候就必须放开一些事情）
　　3）自己区分事情的主次，不要靠危机来安排你的行为（领导面临真正的考验在于，没有危机的时候他在做什么）

　　一心二用：
　　成功解决问题的领导能够创造一个环境，环境带来的汇报要超出他们的付出。同时，这个环境能帮助与之相关的所有人，没有人会受骗上当。

　　最便宜的学费：
　　最便宜的学习方式是研究你身边最优秀的人的学习方法，可以在和他们相处的任何时候（拼车上班、陪同演讲、主持评审等），他们已经替你付了学费，你需要的就是倾听，一个子儿都不用出

　　每天多赢得一点时间
　　不要做那些已经分配下去的任务，即便你必须让手下人犯错误
　　不要操心琐碎的细节
　　不要浪费时间来证明你的全知全能
　　不要浪费时间来为浪费时间争论
　　注意自己无事可干的时候在做什么
　　花出去一分钱，至少要赚回两分钱
　　做评审的领导
　　做编辑
　　做辅导员
　　协调演讲或训练计划
　　充分利用你的拼车机会
　　分享阅读成果
　　好好吃顿有创意的午饭

　　最重要的是：
　　倾听其他人已经学到的知识

　　还有：
　　让其他人展示他们的聪明才智


第二十四章 支持从哪里来
　　成为领导的人认为他们将要帮助别人。不久他们就认识到，需要帮助的正是自己。他们需要帮助才能看清旁人眼中的自己，才能改正错误，才能了解其他人，才能面对向往帮助别人遇到时会遇到的挫折。想要成为能帮助别人的唯一办法，就是学会接受帮助。
　　能够从单独行动的创新者顺利转变成高效有力的解决问题的领导的人，通常拥有一张由其他人构成的支持网络，尽管他们通常不会时刻记得网络的存在。如果你希望成长，最好的办法可能就是了解和培养自己的个人支持系统。

　　无论我们是不是作者，我们都需要这种批评的支持来克服激励其他人的第一大障碍。这种支持比技术支持更难获得。我们必须离的足够近，才能听到反馈，而不会充耳不闻。另一方面，又不能离得太近，否则他们就不会看的清楚，也说不出任何可能伤害我们感受的话。

　　寻求支持是强者的表现，而不是弱者的表现。不要太喜欢过分高效地提供你索要信息的人，要喜欢成长，成长需要冒风险探索未知。

　　如果你希望改变，你认识的某些人会尝试阻止你的改变。这些阻力是好是坏，取决于改变本身。

　　人们很容易就会陷入陷阱，你寻求帮助时，会无意识地选择能够给出自己所希望听到答案的人。这种做法的最大问题在于，你无法意识到这一点。因为不明白你正在做的事情，你就陷入了一个僵化的模式：或者是绝望地坚守你已经有的东西，或者抓住一切机会，为改变而改变。

　　'做你真正想做的'，这句支持来自于你最贴心的支持者：朋友。

　　解决问题的领导力的悖论在于，你必须改变才能保持不变。

　　我们很容易忘记：在大多数时候，我们大多数人可以不需要其他人的特殊帮助就能做的很好。

　　系统支持的几个方面：技术资源、批评、成长、康复、情绪、精神、维持领导力

总结
　　如果你连自己的生活都管不好，又怎么能管理别人呢？
　　在你准备说或者做可能后悔的事情之前，尝试自己镇静一段时间，然后问自己三个问题：
　　1）我为什么要做这件事？
　　2）我有什么资本？
　　3）我有什么不足？