    一对一交流的想法来源两篇文章：《与员工一对一交流：企业经营必行之道》，《你知道我今天为什么来公司上班吗？》。
重要性这里不再赘述。认为不重要的可以使用这样的逻辑思考：

1、  你是否想让你的直接领导找你沟通，并且说出你的真实想法？
2、  想怎么样被管理，就怎么样管理别人。

 按照这两篇文章的思路，我进行了一次员工的面谈，这里总结一下其中的经验。
 具体操作

    首先，这次面谈是由我一个人来完成的，面谈的对象包括所有的研发员工。最后主管一级的员工没有全部进行交流，
后面要进行补充。
其次，面谈的问题基本来自上面的文章中，包括：
·        关于我们公司的发展，你有什么好的想法？
·        你觉得我们目前面临的头号问题是什么？为什么会这样想？
·        在我们公司工作有什么不甚理想的地方？
·        同事里面你对谁的意见最大？谁给你留下的印象最好？
·        如果我把自己的位置交给你，你会对哪些方面进行变革？
·        我们的产品有什么让你觉得不满意的地方？
·        你觉得我们现在是不是有什么大的机遇没有把握住？
·        有什么事你觉得我们是应该办但却还没办的？
·        在这工作开心吗？
·        我们的建议，职业规划，学习计划，生活。（这个是我添加的）

面对的地点在我们公司的会议室中，时间是在工作时间。
收获
虽然不是很完善，但是也获得了一些比较有价值的信息：
1、  促进员工将技术交流，增加对员工的培训。
2、  项目计划制定不够合理或执行不力。经常先松后紧，开发压缩测试时间，版本提交经常延期。
3、  因为没有合适的项目管理工具，流程的执行效率低下。
4、  中层管理者要多关心一下下属的工作。
 可优化的地方
1、  应该由员工的直接主管来进行沟通，而不是由更高层管理者直接沟通。一个原因是上下级之间有更多的“共同语言”
     需要沟通，他们面临的相同问题更多一点，有共同的思考。这次我自己组织的这次沟通过程中存在这样一种状况：
     我想知道的和他们想说的有错位，他们想说的和能说的是他们的直接领导最想知道的。另一个原因是，人数太多，沟通也很耗时间。
2、  沟通的主题：这次基本按照上面的一些问题来进行沟通。首先这些问题有好几个差不多是重复的，或者区别不明显。
     其次，一线的员工更加关注的是他自己的工作以及他们所在组或部门的发展。所以，沟通的主题应该做一些优化，
     要更加贴近他们的工作。
3、  沟通的时间和地点：有文章建议多请下属吃饭，吃饭时进行沟通。这次我没有尝试。是一个可以考虑的地方。

 
有效定通的挑战：
    要想一对一的沟通能够真正的起到作用，最大的挑战其实是如何让他们说出他们真实的想法。很多人出于诸多考虑
（个人的发展，在乎领导的看法，为了领导的“面子”等）而不愿意将自己的真实想法说出来，特别是面对管理者（我也
有这样的阻碍）。几个可以考虑的做法是：
1、  不要将沟通的结果作为考核，升职，加薪的依据。
2、  在团队中营造一种敢于表达的氛围，关键是要“不以言举人，不以人废言”，还有“不以言废人”。
3、  沟通者的沟通技巧：选择合适的时间与地点，营造宽松的气氛，在沟通中保持真诚，多听少说，多理解少反驳，保持一颗“初心”。


具体制度：
下面是沟通的具体制度：
1、  一对一沟通由各级主管组织，定期对直接下属进行。建议每季度一次，最长不得超过半年。
2、  时间要和员工协商，地点可以自己选择。
3、  沟通的主题：沟通者需要适当引导，让员工说出他们真正的想法。沟通的主题可以围绕上面的几点来展开，但是不限于此。主要包括：
a)        对项目组，部门，或公司的发展或优化有没有好的想法或建议？
b)        我们在项目组，部门，公司的管理上（包括开发流程，管理制度，氛围，员工福利，工作环境，管理者等各个方面）有没有做的不好的地方？为什么？有没有好的解决方法？
c)        在工作或学习中有没有遇到什么困难？生活中有没有遇到什么困难？需不需要帮助？
d)        可以谈一下现在的工作，或者具体的工作。
e)        换为思考，如果你是管理者，你会做什么变革？
f)         我们应该把握住那些机遇？这一主题对管理者非常有用。
g)        我们的建议，员工的职业规划，学习计划，生活。
这些主题最好不要采用一问一答的方式，太过正式而阻碍员工说出真实的想法。最好在不知不觉中获得答案。
4、  需要沟通记录与总结。并且汇报。

高层还是有必要找一下自己下面所有的员工沟通一下：每年一次。