#include <stdio.h>
#include <stdlib.h>

int main(void){
    int a[3][4] = {{1,11,111,1111}, {2,22,222,2222}, {3,33,333,3333}};
    int (*p)[4]; //该语句是定义一个数组指针，指向含4个元素的一维数组。
    
    p=a;        //将该二维数组的首地址赋给p，也就是a[0]或&a[0][0]
    // p++;       //该语句执行过后，也就是p=p+1;p跨过行a[0][]指向了行a[1][]
    
    int i=0;
    int *q[3];//这里int *p[3] 表示一个一维数组内存放着三个指针变量，分别是p[0]、p[1]、p[2]
    // p++; //该语句表示p数组指向下一个数组元素。注：此数组每一个元素都是一个指针,所以要分别赋值。
    for(i=0;i<3;i++){
    q[i]=a[i];
    }
    
    // 数组指针和指针数组在指向二维数组时，其引用是一样的，比如要表示数组中i行j列一个元素：
    i=0;
    int j=2;
    printf("*(p[%d]+%d)=%d\n", i, j, *(p[i]+j));
    printf("*(q[%d]+%d)=%d\n", i, j, *(q[i]+j));
    
    printf("*(*(p+%d)+%d)=%d\n", i, j, *(*(p+i)+j));
    printf("*(*(q+%d)+%d)=%d\n", i, j, *(*(q+i)+j));
    
    printf("(*(p+%d))[%d]=%d\n", i, j, (*(p+i))[j]);
    printf("(*(q+%d))[%d]=%d\n", i, j, (*(q+i))[j]);
    
    printf("p[%d][%d]=%d\n", i, j, p[i][j]);
    printf("q[%d][%d]=%d\n", i, j, q[i][j]);
    
// 如果想要把什么东西的类型强制转换为指向数组的指针，就不得不使用下面的语句来表示这个强制类型转换：
    char (*m)[20];  /*j是一个指向数组的指针，组内右20个char元素。*/
    m = (char (*)[20])malloc(20);
    free(m);
    
    return 0;
}