#include "exynos_4412.h"

/*****PWM实验*****/

/*****实验目的：使用PWM外设模块驱动蜂鸣器发出声音*****/

//占空比 = 高电平时间/周期

/*****实验步骤*****/

//1.查看电路图，找到蜂鸣器连接在了GPD0_0管脚

//2.按照芯片手册设置相应的寄存器

void main(void)
{
	/*1.将GPD0_0设置成PWM功能通过设置GPD0CON*/
	GPD0.CON = GPD0.CON & (~(0xF << 0)) | (0x2 << 0);
	/*2.设置一级预分频为100，频率 = 100M / (99 + 1) = 1M*/
	PWM.TCFG0 = PWM.TCFG0 & (~(0xFF << 0)) | (99 << 0);
	/*3.设置二级预分频为1，     频率 = 100M / (99 + 1) / 1 = 1M*/
	PWM.TCFG1 = PWM.TCFG1 & (~(0xF << 0));
	/*4.设置周期，将周期设置为1ms，即频率为1000HZ*/
	PWM.TCNTB0 = 1000;
	/*5.设置占空比为50％*/
	PWM.TCMPB0 = 500;
	/*6.将模式设置为自动重装载*/
	PWM.TCON = PWM.TCON | (1 << 3);
	/*7.将TCNTB0中的值更新到TCNTO0*/
	PWM.TCON = PWM.TCON | (1 << 1);
	/*8.将手动装载关闭*/
	PWM.TCON = PWM.TCON & (~(1 << 1));
	/*9.打开定时器0*/
	PWM.TCON = PWM.TCON | (1 << 0);

	while(1)
	{

	}
}
