http://wdxtub.com/2014/09/11/is-light-up-clip/

-- 如果一个候选人缺乏职位所要求的能力，他就会格外听命于任命者。
-- 他在自己的工作范围内对上级负责，同时又不至于威胁到他们的职位。
大多数情况下，问题的根源在你自己身上。

第零章：总结
1. 问题是什么？
2. 哪里出了问题？
3. 问题该由谁解决？
4. 你真的想解决问题吗？

第一章：问题是什么? 
A)动手去解决问题之前，好好定义问题想想他的来源；但这不等于沉迷其中不动手去解决问题.
  定义要做的事便是问两个问题:这是谁的问题,他问题的本质是什么 
B)境遇和地位不同的人他们对同一件事情所认为的问题往往是不同的.你感觉到的问题未必是其他人感到的问题. 
C)问题是你期望的东西与现实体验的东西之间的差别,尤其是你感觉到的任何不顺都是问题 
  从本质的原因到人心中具体的问题之间有很长一段距离,在其中选一个便能解决问题. 
D)后记.不要为没有幽默感的人解决问题(其实换一个角度看,后记告诉人的是,判断事情道德与否,往往不是
  你一个人一厢情愿决定的了的,所以不要把貌似不道德的事情排除在可能性之外. 
problem(问题是什么?){
其实，先问自己几个问题再给出答案也许是更明智的做法。 
1. 这是什么类型的问题？
2. 谁碰到了问题？
3. 问题是什么？
4. 或者说，此时此刻，问题的本质是什么？ 

   先来看"谁碰到了问题"，这样问是为了: 
1. 确定服务对象，也就是弄清楚解决问题是为了让谁满意。 
2. 为找到合适的解决方案提供一些线索。

    对于想成为问题解决者的人来说，入门的关键在于把单一思维模式切换成多重思维模式，即从能解决一个问题的人
"到"能解决很多问题的人，或者说"问题解决者"。
上班族                                          vs. 梁龙先生
怎么花最少的时间和精力、受最少的气完成我的工作? vs. 我要怎么处理这些该死的投诉？

理想状态                                        vs. 现实状态
理想的状态是乘坐电梯只需要等一小会儿，          vs. 现实的状态则是现在等待的时间太长了。
}

A) 不要把别人的解决方法当成问题的定义,作者要表达的是当别人要你协助解决问题时,你要要求拿到的是
   整个问题,而非他们已经解决到自己完成不了的那个部分.也就是不能病人说头疼就医头,脚疼就医脚.  
B) 别把解决方法认为是问题的定义-尤其是自己的解决方法.这句话与本段A的区别在于,这个问题并不是别人
   的问题而是在解决你自己问题的时候,不要把问题用你的解决方法来定义,因为这样会很大程度上限制你
   解决问题的灵活性.解决问题所用的方法也将是你最熟悉的而非最合理的那个方法. 
C) 你永远不能肯定你已经有了一个正确的定义.即使在问题完成了以后.因为正确是基于你所得到的信息的,
   而你永远不可能确定是否掌握了所有的信息,而即使掌握了对信息筛选以及对有效性的顾虑也会让你永远
   不能肯定你是否有了一个定义. 
   虽然如此,但你永远不要放弃对他的追求. 
problem(问题是什么?续){
实际操作中，一方面，对日常生活中自然产生的问题，不可能给出独一无二、完全明确的定义；
          另一方面，如果不能就问题本身达成一定程度的共识，几乎可以肯定，最后找到的解决方案无法切中要害。

    你永远无法确定已经找到的问题定义是正确的，但是永远不要停下找正确定义的脚步。
    如果你太轻易地解决了他们的问题，他们永远都不会相信你真的解决了他们的问题。
    道德顾虑在遇到有利可图的问题时往往很快就烟消云散了
    
1. 每一个解决方案都是下一个问题的来源。
2. 某些问题最困难的部分就在于发现问题存在。
3. 如果在对问题的理解中，你想不出至少3种可能出错的地方，那么你并没有真正地理解这个问题。
   每个解决问题的方案都会带来三个新的问题
   每种解决方法都会带来新的问题。
4. 每转换一次视角都会发现新的不协调之处：
    在把一项"解决方案"付诸实践之前从各个视角对其审视一遍，不是比等到出现灾难性后果才意识到问题存在好得多吗？
5. 如果想得到不同的解决方案，该怎样变化问题的表述方式?  问题的表达方式直接或间接影响理解人的思考方式。
6. 当你沿着定义问题的道路疲倦前行时，过一会儿就要回头看看，确认自己没有走错路。

1. 不要把别人的解决方法作为定义问题的方法。 
2. 如果你解决问题太过神速，别人根本不会相信你真的解决了问题。
3. 别把问题的解决方案误当做问题的定义，当这个解决方案是由你提出的时候尤是如此。
4. 即使问题已经解决，你也无法确定你的问题定义是正确的。
}

A) 问题最难的部分就是去意识到他的存在. 
  每种解决方法都会带来新的问题:因为无法有个精确的定义所以带来新的问题自然不可避免.所以作者建议对于
  问题的理解中,要想出至少 
B)对设计者而言,由于他们和最终使用者们之间的差异,导致他们只解决了某些群体的问题,但代价却常常是引发
  另一个群体的灾难.而对于使用者而言,尤其是觉得东西不怎么方便的使用者而言.他们有一种强大的适应性来
  渐渐的把灾难习惯化.从而渐渐淡忘了问题的存在. 
  故作者也对这两类人给出了这样的两条建议:设计者要常把自己变成外国人,盲人,孩子一样去看待自己的作品.
  而对使用者,不要轻易的下结论,但也不要淡忘了自己的第一印象.而在解决问题的途中也是一样要时不时的看看
  自己是否已经迷路. 
C)人无法处理问题原因常常有二,问题的答案空间太大或是无法建立可行的答案空间.而其实前者并非我们找不到
  好的答案只是我们懒而已.故作者建议在面对问题束手无策时,可以适当的加一些不同的条件来辅助思考.这样也
  更有助于多角度的看待一个问题.而最后作者也指出在你解决问题一筹莫展时,也该回头看看你对问题的理解是
  否正确. 
D)一旦你用文字来表述一个问题,要确信在每个人的脑中他都是同一个意思.而作者给出了,先用改变需要重读的词组,
  再对关键的词组查字典的方式.且最好把定义和指代副词替换成你认为他的含义.而当难以用文字表达时试着用公式
  图片等其他方式来, 

第二章：问题的表述?
problem(问题的表述?){
1. 一旦你用文字来表述一个问题，请仔细推敲这些文字，让表述在每个人头脑中都是一个意思。
2. 一旦你将这一个问题描述拟成文字，做些文字游戏，以确保每个人对问题的理解可以统一。
玛丽曾有一只小羔羊。(而不是约翰有)
玛丽曾有一只小羔羊。(但现在没有了)
玛丽曾有一只小羔羊。(和别人有几只不一样)
玛丽曾有一只小羔羊。(和你想的不一样，不是一只大的)
玛丽曾有一只小羔羊。(那只狗是亨利的)
}

第三章：谁碰到了问题? 
A) 当别人能够很好的解决自己的问题时,千万不要越俎代庖.因为他们对自己比外来的解决者对问题有更深刻的
   认识和体会,也有这个欲望.外来的介入也许只会弄巧成拙.简而言之,如果这是它的麻烦,那就让他成为它的麻烦 
B) 如果某人能够解决问题,但是他本人遇见不了这个问题,首先要做的便是让他体验到这个问题. 这句话主要是
   对遇到了问题,但自身无法解决,而有能力解决的人却遇不到问题的这种情况.不得不说在合作管理中这种情况
   非常常见. 
   而智慧的作者意识到,有时有能力解决问题的人即使意识到问题也不会去解决问题的情况.他又补充道
   "与其诅咒黑暗,不如点亮光明"的话,当你感觉改变环境无力时,那就试着改变下自己吧.
   "换过来指责下你自己,哪怕只是一秒钟,困境可能便会消融" 
C) 有时问题的受害者,并不是没有能力去解决问题,他们只是暂时没有意识到问题的存在而已.这时作为旁观者
   清的你,不帮则眼看其受苦,帮太多则会弄巧成拙,最好的方式则是用一句善意的提醒.让他意识到问题的存在即可. 
problem(谁碰到了问题? ){
1. 如果这是他们的麻烦，就让它成为他们的麻烦。
2. 如果某人能够解决这个问题，但是他本人却不会遇到这个问题时，那么你们首先要做的就是让它也感受到这个问题，体会到麻烦。
3. 换过来指责一下自己——即使只有一秒钟。
}

第四章：问题该由谁来解决?
problem(问题该由谁来解决?){
1. 当别人可以妥善解决自己的问题的时候，不要越俎代庖。 
   如果这是别人的问题，就把它当成是别人的问题。
   如果一个人处于解决问题的位置，却不受问题困扰，那就采取一些行动是他能亲身体验到问题。
   为了改变局面，试着把责任归到自己身上 --- 哪怕只有一会儿也行。
2. 如果人们真的开着车灯，一个小小的提醒可能比复杂的解决方案更有效。
}

第五章：问题来自哪里?
A) 问题的本质原因常常是多种多样的,你需要的是从现实中不断的收集证据从可能的原因中找到真正的那个原因,
   而不是根据自己的主观臆断就把原因归结于天性命运等不可解因素,虽然也存在这种可能,但这种懒惰的做法
   让你永远解决不了问题. 
B) 不论你成不承认很多问题的本质是来自于你自己.不论是定义错问题,还是误判了情况. 
C) 这世界上有两种人,给人找事做的人和做事的人.而为了体现自己的价值,前者经常无中生有的制造些麻烦给后者,
   对于后者来说这些要他们解决的问题,根本就不是问题.而作者给出的建议是戳穿诡计后不要浪费你自己的时间,
   保持尊重的推掉他并把荣誉留给制造麻烦的人. 
D) 考试等难题来源又是何处呢,作者指出要解决这些问题要明白的便是谁出的问题他又想对我们做什么,而智慧的
   作者还进一步指出要解决这些所谓的问题,从出题者普遍想把问题弄难的心理出发,往往能更轻松的解决问题. 
problem(问题来自哪里?){
1. 命运只是天性的别名而已。它是世界上所有不作为行为的头号借口。
2. 问题的根源常常都在抱怨者自己身上。
3. 在问题解决者的山谷里，制造问题的人士国王、总统或者主教。（精辟！）
我们永远没有足够时间来把它做好，但是我们总有足够时间来重新做一遍。
我们永远没有足够时间来考虑我们是否真的需要它，但是我们总有足够时间来为之后悔。

4、人类适应性倾向：重复的刺激会导致反应越来越小。适应性允许我们忽略环境中恒久不变的东西，
   当我们的世界中出现新事物的时候，它是最富刺激性的。在它保持了一小段时间，既不带来威胁
   也不带来机会之后，它变成了"环境"的一部分，或者说背景。最后，它被完全略去了。
鱼总是最后一个看到水的。

}

6)我们真的想解决问题吗 
A) 长期的学校教育把我们培养成了一个急着去解决问题,但其实并不确切知道问题是什么的人.作者指出当你
   确切知道问题是什么时,解决问题便会变得异常的容易.而这种人定义问题常会犯解决式提问的方式,即他
   解决问题时需要什么,他便问什么,另外值得一提的是故事中的雇主和解决问题者都犯了这个错误.而作者
   也得出了,不管人们看上去如何但是他们很少知道他们要的是什么,直到他们所要求的东西. 
B) 并没有多少人希望这个问题被解决.也许是因为不同人对同一件事的看法和得失各有不同,也出于对人类
   短视的本能. 
C) 我们永远没时间去考虑我们是否真的需要他,但我们永远有足够的时间为之后悔.这里的含义与A略有不同,
   其主要指的是知道问题定义,但未考虑事情完成时其他副作用的情况.而忽略的原因作者指出是由于人类的
   适应性所造成的. 
D) 最后作者希望每个人在解决问题前先对自己真诚即考虑问题如何解决前先考虑其是否道德 .


第六章：问题来自哪里?
1.  这是一个关于投标的故事，程序员比利解决问题学到第一条经验：不要把他们解决问题的方法当作问题的定义。（用错了方法意味着最终解决问题有更短的路径）
2.  比利学到的第二条经验：如果你太轻易地解决了他们的问题，他们永远不会相信你真正解决了问题。（这其实也是一句充满了智商优越感的吐槽）
比利咬到了自己的舌头
1.  故事延续，并出现了新的转折，比利的同事碰巧也遇到了该投标问题，并设计了一个解决程序，比利想到的是：不要把问题的解决方法误认为是问题的定义——特别在你使用自己的解决方法的时候。（这句结论出现的时候跳跃性太强，事实上是说，表面上的解决办法，其实很可能不是最好的解决办法——程序员倾向于使用程序员的方法来解决问题）
比利回到了投标人中间
1.  比利往更深层次想：问题并不是最初呈现的样子：它既不是一个列举400万投标组合的问题，也不是符号逻辑和常识问题——更不是线性规划编程问题（翻译者应该不太懂数学和编程），问题更深入一些：
2.  也许这才是问题：当所有竞争者都在改变标价，并且认为自己唯一有优先权这么做，你应该如何修改标价？或者更深一层：
3.  当其他所有竞争者都在改变标价，改变的同时知道，当你知道他们在改变标价的同时也会改变你的标价，你会怎么修改标价？或再深一层：
4.  如果一个公司知道别的公司会看到它的标价，它会努力给一个表面首次标价来误导其他公司。
5.  经过这一系列思考，比利得出一个结论：你永远不能肯定你有了一个正确的定义，即使在问题已经解决以后。
6.  比利在摆了几个小时"沉思者"造型后，又得出一个结论：不要过早下结论，但是也不要忽略你的第一印象。（这个结论的跳跃性又太大了）
7.  问题是什么？比利的终极认识：你永远也不能肯定你有了一个正确的定义，但是永远不要放弃追寻它的努力。

第七章 什么是真正的问题
无穷无尽的锁链
1. 丹尼解决一个打印工艺问题，设计了一个配件，结果这个配件上的针把主管扎了——每种解决办法都会带来新问题。
2. 人经常忽略一些（例如是设计不当导致的）问题，问题最难以处理的部分恰恰是去意识到他们的存在。
3. 如果在对问题的理解中，你想不出至少3种可能出错的地方，那么你并没有真正地理解这个问题。（这是一句很强的独断式的结论）

第八章  教室里的雪茄烟雾
1. 场景，教室里烟雾弥漫：这是该谁来解决的问题？当别人能很好解决自己问题的时候，千万不要越俎代庖。
2. 如果这是他们的麻烦，就让它成为他们的麻烦。（跳跃性很大，这里所举的是一个反面的例子，我的麻烦变成我们的麻烦）

第九章  校区的停车场
1. 通过雷龙塔故事学到的解决问题的原则：如果某人能解决这个问题，但是他本人不会遇到这个问题，那么你们首先要做的是让他也感受到这个问题。
2. 面对问题的时候，不妨换个角度：试试换过来指责你自己——即使只有一秒钟。

第十章 隧道尽头的灯
1. 你的灯亮着吗？——如果人们的灯真亮着，一个小小的提醒，可能比你那些复杂的解决办法都更有效。（这个故事是书名的来源）

第十一章  曼特兹恩兹纳先生扭转了局势
1. 当你确定了问题从哪里来，尤其是问题的根源（常常）在自己身上，那么解决问题变得很简单了。

第十二章  做事情和享受荣誉
解决问题的过程、人员或机构自身也可能成为问题。
1. 在问题解决者的世界中，制造问题的人是国王、总统或者主教。
2. 在这个世界上有两种人，第一种人做事，第二种人给别人找事情做。离第二种人远一点，这样你就会顺利。
3. 在这个世界上有两种人，第一种人做事，第二种人享受荣誉。待在第一种人中间——那里的竞争要少得多。
4. 如何对付闲着找茬的人：写下“这是一个迷人的想法，让我们讨论一下”，拉长流程，让文件在官僚系统里流浪即可。

https://book.douban.com/review/5808754/

https://book.douban.com/review/4880167/