CEO(){
马克·安德森（Web浏览器之父、网景公司创始人）是这样评价安迪·格鲁夫的：
造就硅谷的人如果只能选一位的话，这个人就是 Andy Grove，他为高规格的硅谷公司设立了典范。

Microsoft 创始人 Bill Gates
Andy 和我合作过几个项目，我不停地从他身上学到东西。他站在 PC 行业的前沿，我跟他在一起总是被他的才华和愿景所折服。

《只有偏执狂才能生存》和《十倍速时代》         # Only the Paranoid Survive

《高产出管理》和《格罗夫给经理人的第一课》     # High Output Management
}

ceo(★“战略性转折点”与“偏执狂”){

}

ceo(成功学批判){
1. 成功学的危害——单一化"价值取向"和"人生追求"
    从“社会”的角度来看，多元化体现在很多方面。其中一个重要的方面是社会成员的“价值取向”和“人生追求”。如果某个
 社会中，民众的“价值取向”和“人生追求”是多样化的，那么这个社会就是有活力的，也是健壮的；反之，如果民众的“价值
 取向”和“人生追求”非常单一化，那么这个社会是僵化的，也是脆弱的（容易崩溃）。
 


}